
#### Terragrunt Results
- Format: `success`
- Validate: `success`
- Plan: `success`

<details><summary>Show Plan</summary>

```hcl
04:06:36.327 INFO   The stack at . will be processed in the following order for command plan:%0AGroup 1%0A- Module ./membership%0A%0AGroup 2%0A- Module ./repository%0A%0AGroup 3%0A- Module ./organization%0A%0A%0A04:06:36.758 STDOUT [membership] tofu: OpenTofu used the selected providers to generate the following execution%0A04:06:36.758 STDOUT [membership] tofu: plan. Resource actions are indicated with the following symbols:%0A04:06:36.758 STDOUT [membership] tofu:   + create%0A04:06:36.758 STDOUT [membership] tofu: OpenTofu will perform the following actions:%0A04:06:36.758 STDOUT [membership] tofu:   # github_membership.all["reinhud"] will be created%0A04:06:36.758 STDOUT [membership] tofu:   + resource "github_membership" "all" {%0A04:06:36.758 STDOUT [membership] tofu:       + downgrade_on_destroy = false%0A04:06:36.758 STDOUT [membership] tofu:       + etag                 = (known after apply)%0A04:06:36.758 STDOUT [membership] tofu:       + id                   = (known after apply)%0A04:06:36.758 STDOUT [membership] tofu:       + role                 = "admin"%0A04:06:36.758 STDOUT [membership] tofu:       + username             = "reinhud"%0A04:06:36.758 STDOUT [membership] tofu:     }%0A04:06:36.758 STDOUT [membership] tofu:   # github_team.all["admin"] will be created%0A04:06:36.758 STDOUT [membership] tofu:   + resource "github_team" "all" {%0A04:06:36.758 STDOUT [membership] tofu:       + create_default_maintainer = false%0A04:06:36.758 STDOUT [membership] tofu:       + description               = "Organization wide access, manages day to day organization management"%0A04:06:36.758 STDOUT [membership] tofu:       + etag                      = (known after apply)%0A04:06:36.758 STDOUT [membership] tofu:       + id                        = (known after apply)%0A04:06:36.758 STDOUT [membership] tofu:       + members_count             = (known after apply)%0A04:06:36.759 STDOUT [membership] tofu:       + name                      = "admin"%0A04:06:36.759 STDOUT [membership] tofu:       + node_id                   = (known after apply)%0A04:06:36.759 STDOUT [membership] tofu:       + parent_team_read_id       = (known after apply)%0A04:06:36.759 STDOUT [membership] tofu:       + parent_team_read_slug     = (known after apply)%0A04:06:36.759 STDOUT [membership] tofu:       + privacy                   = "closed"%0A04:06:36.759 STDOUT [membership] tofu:       + slug                      = (known after apply)%0A04:06:36.759 STDOUT [membership] tofu:     }%0A04:06:36.759 STDOUT [membership] tofu:   # github_team.all["ai"] will be created%0A04:06:36.759 STDOUT [membership] tofu:   + resource "github_team" "all" {%0A04:06:36.759 STDOUT [membership] tofu:       + create_default_maintainer = false%0A04:06:36.759 STDOUT [membership] tofu:       + description               = "AI/ML engineering team"%0A04:06:36.759 STDOUT [membership] tofu:       + etag                      = (known after apply)%0A04:06:36.759 STDOUT [membership] tofu:       + id                        = (known after apply)%0A04:06:36.759 STDOUT [membership] tofu:       + members_count             = (known after apply)%0A04:06:36.759 STDOUT [membership] tofu:       + name                      = "ai"%0A04:06:36.759 STDOUT [membership] tofu:       + node_id                   = (known after apply)%0A04:06:36.759 STDOUT [membership] tofu:       + parent_team_read_id       = (known after apply)%0A04:06:36.759 STDOUT [membership] tofu:       + parent_team_read_slug     = (known after apply)%0A04:06:36.759 STDOUT [membership] tofu:       + privacy                   = "closed"%0A04:06:36.759 STDOUT [membership] tofu:       + slug                      = (known after apply)%0A04:06:36.759 STDOUT [membership] tofu:     }%0A04:06:36.759 STDOUT [membership] tofu:   # github_team.all["app"] will be created%0A04:06:36.759 STDOUT [membership] tofu:   + resource "github_team" "all" {%0A04:06:36.759 STDOUT [membership] tofu:       + create_default_maintainer = false%0A04:06:36.760 STDOUT [membership] tofu:       + description               = "Application development team"%0A04:06:36.760 STDOUT [membership] tofu:       + etag                      = (known after apply)%0A04:06:36.760 STDOUT [membership] tofu:       + id                        = (known after apply)%0A04:06:36.760 STDOUT [membership] tofu:       + members_count             = (known after apply)%0A04:06:36.760 STDOUT [membership] tofu:       + name                      = "app"%0A04:06:36.760 STDOUT [membership] tofu:       + node_id                   = (known after apply)%0A04:06:36.760 STDOUT [membership] tofu:       + parent_team_read_id       = (known after apply)%0A04:06:36.760 STDOUT [membership] tofu:       + parent_team_read_slug     = (known after apply)%0A04:06:36.760 STDOUT [membership] tofu:       + privacy                   = "closed"%0A04:06:36.760 STDOUT [membership] tofu:       + slug                      = (known after apply)%0A04:06:36.760 STDOUT [membership] tofu:     }%0A04:06:36.760 STDOUT [membership] tofu:   # github_team.all["platform"] will be created%0A04:06:36.760 STDOUT [membership] tofu:   + resource "github_team" "all" {%0A04:06:36.760 STDOUT [membership] tofu:       + create_default_maintainer = false%0A04:06:36.760 STDOUT [membership] tofu:       + description               = "Platform engineering and infrastructure team"%0A04:06:36.760 STDOUT [membership] tofu:       + etag                      = (known after apply)%0A04:06:36.760 STDOUT [membership] tofu:       + id                        = (known after apply)%0A04:06:36.760 STDOUT [membership] tofu:       + members_count             = (known after apply)%0A04:06:36.760 STDOUT [membership] tofu:       + name                      = "platform"%0A04:06:36.760 STDOUT [membership] tofu:       + node_id                   = (known after apply)%0A04:06:36.760 STDOUT [membership] tofu:       + parent_team_read_id       = (known after apply)%0A04:06:36.761 STDOUT [membership] tofu:       + parent_team_read_slug     = (known after apply)%0A04:06:36.761 STDOUT [membership] tofu:       + privacy                   = "closed"%0A04:06:36.761 STDOUT [membership] tofu:       + slug                      = (known after apply)%0A04:06:36.761 STDOUT [membership] tofu:     }%0A04:06:36.761 STDOUT [membership] tofu:   # github_team_membership.members["admin:reinhud"] will be created%0A04:06:36.761 STDOUT [membership] tofu:   + resource "github_team_membership" "members" {%0A04:06:36.761 STDOUT [membership] tofu:       + etag     = (known after apply)%0A04:06:36.761 STDOUT [membership] tofu:       + id       = (known after apply)%0A04:06:36.761 STDOUT [membership] tofu:       + role     = "maintainer"%0A04:06:36.761 STDOUT [membership] tofu:       + team_id  = (known after apply)%0A04:06:36.761 STDOUT [membership] tofu:       + username = "reinhud"%0A04:06:36.761 STDOUT [membership] tofu:     }%0A04:06:36.761 STDOUT [membership] tofu:   # github_team_membership.members["ai:reinhud"] will be created%0A04:06:36.761 STDOUT [membership] tofu:   + resource "github_team_membership" "members" {%0A04:06:36.761 STDOUT [membership] tofu:       + etag     = (known after apply)%0A04:06:36.761 STDOUT [membership] tofu:       + id       = (known after apply)%0A04:06:36.761 STDOUT [membership] tofu:       + role     = "maintainer"%0A04:06:36.761 STDOUT [membership] tofu:       + team_id  = (known after apply)%0A04:06:36.761 STDOUT [membership] tofu:       + username = "reinhud"%0A04:06:36.761 STDOUT [membership] tofu:     }%0A04:06:36.761 STDOUT [membership] tofu:   # github_team_membership.members["app:reinhud"] will be created%0A04:06:36.761 STDOUT [membership] tofu:   + resource "github_team_membership" "members" {%0A04:06:36.761 STDOUT [membership] tofu:       + etag     = (known after apply)%0A04:06:36.761 STDOUT [membership] tofu:       + id       = (known after apply)%0A04:06:36.761 STDOUT [membership] tofu:       + role     = "maintainer"%0A04:06:36.761 STDOUT [membership] tofu:       + team_id  = (known after apply)%0A04:06:36.762 STDOUT [membership] tofu:       + username = "reinhud"%0A04:06:36.762 STDOUT [membership] tofu:     }%0A04:06:36.762 STDOUT [membership] tofu:   # github_team_membership.members["platform:reinhud"] will be created%0A04:06:36.762 STDOUT [membership] tofu:   + resource "github_team_membership" "members" {%0A04:06:36.762 STDOUT [membership] tofu:       + etag     = (known after apply)%0A04:06:36.762 STDOUT [membership] tofu:       + id       = (known after apply)%0A04:06:36.762 STDOUT [membership] tofu:       + role     = "maintainer"%0A04:06:36.762 STDOUT [membership] tofu:       + team_id  = (known after apply)%0A04:06:36.762 STDOUT [membership] tofu:       + username = "reinhud"%0A04:06:36.762 STDOUT [membership] tofu:     }%0A04:06:36.762 STDOUT [membership] tofu: Plan: 9 to add, 0 to change, 0 to destroy.%0A04:06:36.762 STDOUT [membership] tofu: Changes to Outputs:%0A04:06:36.762 STDOUT [membership] tofu:   + organization_members = {%0A04:06:36.762 STDOUT [membership] tofu:       + reinhud = {%0A04:06:36.762 STDOUT [membership] tofu:           + role     = "admin"%0A04:06:36.762 STDOUT [membership] tofu:           + username = "reinhud"%0A04:06:36.762 STDOUT [membership] tofu:         }%0A04:06:36.762 STDOUT [membership] tofu:     }%0A04:06:36.762 STDOUT [membership] tofu:   + team_memberships     = {%0A04:06:36.762 STDOUT [membership] tofu:       + "admin:reinhud"    = {%0A04:06:36.762 STDOUT [membership] tofu:           + role     = "maintainer"%0A04:06:36.762 STDOUT [membership] tofu:           + team_id  = (known after apply)%0A04:06:36.762 STDOUT [membership] tofu:           + username = "reinhud"%0A04:06:36.762 STDOUT [membership] tofu:         }%0A04:06:36.762 STDOUT [membership] tofu:       + "ai:reinhud"       = {%0A04:06:36.762 STDOUT [membership] tofu:           + role     = "maintainer"%0A04:06:36.762 STDOUT [membership] tofu:           + team_id  = (known after apply)%0A04:06:36.762 STDOUT [membership] tofu:           + username = "reinhud"%0A04:06:36.762 STDOUT [membership] tofu:         }%0A04:06:36.762 STDOUT [membership] tofu:       + "app:reinhud"      = {%0A04:06:36.762 STDOUT [membership] tofu:           + role     = "maintainer"%0A04:06:36.763 STDOUT [membership] tofu:           + team_id  = (known after apply)%0A04:06:36.763 STDOUT [membership] tofu:           + username = "reinhud"%0A04:06:36.763 STDOUT [membership] tofu:         }%0A04:06:36.763 STDOUT [membership] tofu:       + "platform:reinhud" = {%0A04:06:36.763 STDOUT [membership] tofu:           + role     = "maintainer"%0A04:06:36.763 STDOUT [membership] tofu:           + team_id  = (known after apply)%0A04:06:36.763 STDOUT [membership] tofu:           + username = "reinhud"%0A04:06:36.763 STDOUT [membership] tofu:         }%0A04:06:36.763 STDOUT [membership] tofu:     }%0A04:06:36.763 STDOUT [membership] tofu:   + teams                = {%0A04:06:36.763 STDOUT [membership] tofu:       + admin    = {%0A04:06:36.763 STDOUT [membership] tofu:           + description   = "Organization wide access, manages day to day organization management"%0A04:06:36.763 STDOUT [membership] tofu:           + id            = (known after apply)%0A04:06:36.763 STDOUT [membership] tofu:           + members_count = (known after apply)%0A04:06:36.763 STDOUT [membership] tofu:           + name          = "admin"%0A04:06:36.763 STDOUT [membership] tofu:           + node_id       = (known after apply)%0A04:06:36.763 STDOUT [membership] tofu:           + privacy       = "closed"%0A04:06:36.763 STDOUT [membership] tofu:           + slug          = (known after apply)%0A04:06:36.763 STDOUT [membership] tofu:         }%0A04:06:36.763 STDOUT [membership] tofu:       + ai       = {%0A04:06:36.763 STDOUT [membership] tofu:           + description   = "AI/ML engineering team"%0A04:06:36.763 STDOUT [membership] tofu:           + id            = (known after apply)%0A04:06:36.763 STDOUT [membership] tofu:           + members_count = (known after apply)%0A04:06:36.763 STDOUT [membership] tofu:           + name          = "ai"%0A04:06:36.763 STDOUT [membership] tofu:           + node_id       = (known after apply)%0A04:06:36.763 STDOUT [membership] tofu:           + privacy       = "closed"%0A04:06:36.763 STDOUT [membership] tofu:           + slug          = (known after apply)%0A04:06:36.763 STDOUT [membership] tofu:         }%0A04:06:36.764 STDOUT [membership] tofu:       + app      = {%0A04:06:36.764 STDOUT [membership] tofu:           + description   = "Application development team"%0A04:06:36.764 STDOUT [membership] tofu:           + id            = (known after apply)%0A04:06:36.764 STDOUT [membership] tofu:           + members_count = (known after apply)%0A04:06:36.764 STDOUT [membership] tofu:           + name          = "app"%0A04:06:36.764 STDOUT [membership] tofu:           + node_id       = (known after apply)%0A04:06:36.764 STDOUT [membership] tofu:           + privacy       = "closed"%0A04:06:36.764 STDOUT [membership] tofu:           + slug          = (known after apply)%0A04:06:36.764 STDOUT [membership] tofu:         }%0A04:06:36.764 STDOUT [membership] tofu:       + platform = {%0A04:06:36.764 STDOUT [membership] tofu:           + description   = "Platform engineering and infrastructure team"%0A04:06:36.764 STDOUT [membership] tofu:           + id            = (known after apply)%0A04:06:36.764 STDOUT [membership] tofu:           + members_count = (known after apply)%0A04:06:36.764 STDOUT [membership] tofu:           + name          = "platform"%0A04:06:36.764 STDOUT [membership] tofu:           + node_id       = (known after apply)%0A04:06:36.764 STDOUT [membership] tofu:           + privacy       = "closed"%0A04:06:36.764 STDOUT [membership] tofu:           + slug          = (known after apply)%0A04:06:36.764 STDOUT [membership] tofu:         }%0A04:06:36.764 STDOUT [membership] tofu:     }%0A04:06:36.821 WARN   [repository] Config ./membership/terragrunt.hcl is a dependency of ./repository/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.%0A04:06:37.290 STDOUT [repository] tofu: OpenTofu used the selected providers to generate the following execution%0A04:06:37.290 STDOUT [repository] tofu: plan. Resource actions are indicated with the following symbols:%0A04:06:37.290 STDOUT [repository] tofu:   + create%0A04:06:37.290 STDOUT [repository] tofu: OpenTofu will perform the following actions:%0A04:06:37.290 STDOUT [repository] tofu:   # github_issue_label.all[".github:bug"] will be created%0A04:06:37.291 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {%0A04:06:37.291 STDOUT [repository] tofu:       + color       = "d73a4a"%0A04:06:37.291 STDOUT [repository] tofu:       + description = "Something isn't working"%0A04:06:37.291 STDOUT [repository] tofu:       + etag        = (known after apply)%0A04:06:37.291 STDOUT [repository] tofu:       + id          = (known after apply)%0A04:06:37.291 STDOUT [repository] tofu:       + name        = "bug"%0A04:06:37.291 STDOUT [repository] tofu:       + repository  = ".github"%0A04:06:37.291 STDOUT [repository] tofu:       + url         = (known after apply)%0A04:06:37.291 STDOUT [repository] tofu:     }%0A04:06:37.291 STDOUT [repository] tofu:   # github_issue_label.all[".github:stuff"] will be created%0A04:06:37.291 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {%0A04:06:37.291 STDOUT [repository] tofu:       + color       = "a2eeef"%0A04:06:37.291 STDOUT [repository] tofu:       + description = "Stuff"%0A04:06:37.291 STDOUT [repository] tofu:       + etag        = (known after apply)%0A04:06:37.291 STDOUT [repository] tofu:       + id          = (known after apply)%0A04:06:37.291 STDOUT [repository] tofu:       + name        = "stuff"%0A04:06:37.291 STDOUT [repository] tofu:       + repository  = ".github"%0A04:06:37.291 STDOUT [repository] tofu:       + url         = (known after apply)%0A04:06:37.291 STDOUT [repository] tofu:     }%0A04:06:37.291 STDOUT [repository] tofu:   # github_issue_label.all["github-management:bug"] will be created%0A04:06:37.291 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {%0A04:06:37.291 STDOUT [repository] tofu:       + color       = "d73a4a"%0A04:06:37.291 STDOUT [repository] tofu:       + description = "Something isn't working"%0A04:06:37.291 STDOUT [repository] tofu:       + etag        = (known after apply)%0A04:06:37.291 STDOUT [repository] tofu:       + id          = (known after apply)%0A04:06:37.291 STDOUT [repository] tofu:       + name        = "bug"%0A04:06:37.292 STDOUT [repository] tofu:       + repository  = "github-management"%0A04:06:37.292 STDOUT [repository] tofu:       + url         = (known after apply)%0A04:06:37.292 STDOUT [repository] tofu:     }%0A04:06:37.292 STDOUT [repository] tofu:   # github_issue_label.all["github-management:stuff"] will be created%0A04:06:37.292 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {%0A04:06:37.292 STDOUT [repository] tofu:       + color       = "a2eeef"%0A04:06:37.292 STDOUT [repository] tofu:       + description = "Stuff"%0A04:06:37.292 STDOUT [repository] tofu:       + etag        = (known after apply)%0A04:06:37.292 STDOUT [repository] tofu:       + id          = (known after apply)%0A04:06:37.292 STDOUT [repository] tofu:       + name        = "stuff"%0A04:06:37.292 STDOUT [repository] tofu:       + repository  = "github-management"%0A04:06:37.292 STDOUT [repository] tofu:       + url         = (known after apply)%0A04:06:37.292 STDOUT [repository] tofu:     }%0A04:06:37.292 STDOUT [repository] tofu:   # github_issue_label.all["gitops:bug"] will be created%0A04:06:37.292 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {%0A04:06:37.292 STDOUT [repository] tofu:       + color       = "d73a4a"%0A04:06:37.292 STDOUT [repository] tofu:       + description = "Something isn't working"%0A04:06:37.292 STDOUT [repository] tofu:       + etag        = (known after apply)%0A04:06:37.292 STDOUT [repository] tofu:       + id          = (known after apply)%0A04:06:37.292 STDOUT [repository] tofu:       + name        = "bug"%0A04:06:37.292 STDOUT [repository] tofu:       + repository  = "gitops"%0A04:06:37.292 STDOUT [repository] tofu:       + url         = (known after apply)%0A04:06:37.292 STDOUT [repository] tofu:     }%0A04:06:37.292 STDOUT [repository] tofu:   # github_issue_label.all["gitops:stuff"] will be created%0A04:06:37.292 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {%0A04:06:37.292 STDOUT [repository] tofu:       + color       = "a2eeef"%0A04:06:37.292 STDOUT [repository] tofu:       + description = "Stuff"%0A04:06:37.293 STDOUT [repository] tofu:       + etag        = (known after apply)%0A04:06:37.293 STDOUT [repository] tofu:       + id          = (known after apply)%0A04:06:37.293 STDOUT [repository] tofu:       + name        = "stuff"%0A04:06:37.293 STDOUT [repository] tofu:       + repository  = "gitops"%0A04:06:37.293 STDOUT [repository] tofu:       + url         = (known after apply)%0A04:06:37.293 STDOUT [repository] tofu:     }%0A04:06:37.293 STDOUT [repository] tofu:   # github_issue_label.all["infra-live:bug"] will be created%0A04:06:37.293 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {%0A04:06:37.293 STDOUT [repository] tofu:       + color       = "d73a4a"%0A04:06:37.293 STDOUT [repository] tofu:       + description = "Something isn't working"%0A04:06:37.293 STDOUT [repository] tofu:       + etag        = (known after apply)%0A04:06:37.293 STDOUT [repository] tofu:       + id          = (known after apply)%0A04:06:37.293 STDOUT [repository] tofu:       + name        = "bug"%0A04:06:37.293 STDOUT [repository] tofu:       + repository  = "infra-live"%0A04:06:37.293 STDOUT [repository] tofu:       + url         = (known after apply)%0A04:06:37.293 STDOUT [repository] tofu:     }%0A04:06:37.293 STDOUT [repository] tofu:   # github_issue_label.all["infra-live:stuff"] will be created%0A04:06:37.293 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {%0A04:06:37.293 STDOUT [repository] tofu:       + color       = "a2eeef"%0A04:06:37.293 STDOUT [repository] tofu:       + description = "Stuff"%0A04:06:37.293 STDOUT [repository] tofu:       + etag        = (known after apply)%0A04:06:37.293 STDOUT [repository] tofu:       + id          = (known after apply)%0A04:06:37.293 STDOUT [repository] tofu:       + name        = "stuff"%0A04:06:37.293 STDOUT [repository] tofu:       + repository  = "infra-live"%0A04:06:37.293 STDOUT [repository] tofu:       + url         = (known after apply)%0A04:06:37.293 STDOUT [repository] tofu:     }%0A04:06:37.294 STDOUT [repository] tofu:   # github_issue_label.all["infra-modules:bug"] will be created%0A04:06:37.294 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {%0A04:06:37.294 STDOUT [repository] tofu:       + color       = "d73a4a"%0A04:06:37.294 STDOUT [repository] tofu:       + description = "Something isn't working"%0A04:06:37.294 STDOUT [repository] tofu:       + etag        = (known after apply)%0A04:06:37.294 STDOUT [repository] tofu:       + id          = (known after apply)%0A04:06:37.294 STDOUT [repository] tofu:       + name        = "bug"%0A04:06:37.294 STDOUT [repository] tofu:       + repository  = "infra-modules"%0A04:06:37.294 STDOUT [repository] tofu:       + url         = (known after apply)%0A04:06:37.294 STDOUT [repository] tofu:     }%0A04:06:37.294 STDOUT [repository] tofu:   # github_issue_label.all["infra-modules:stuff"] will be created%0A04:06:37.294 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {%0A04:06:37.294 STDOUT [repository] tofu:       + color       = "a2eeef"%0A04:06:37.294 STDOUT [repository] tofu:       + description = "Stuff"%0A04:06:37.294 STDOUT [repository] tofu:       + etag        = (known after apply)%0A04:06:37.294 STDOUT [repository] tofu:       + id          = (known after apply)%0A04:06:37.294 STDOUT [repository] tofu:       + name        = "stuff"%0A04:06:37.294 STDOUT [repository] tofu:       + repository  = "infra-modules"%0A04:06:37.294 STDOUT [repository] tofu:       + url         = (known after apply)%0A04:06:37.294 STDOUT [repository] tofu:     }%0A04:06:37.294 STDOUT [repository] tofu:   # github_repository.all[".github"] will be created%0A04:06:37.294 STDOUT [repository] tofu:   + resource "github_repository" "all" {%0A04:06:37.294 STDOUT [repository] tofu:       + allow_auto_merge            = true%0A04:06:37.294 STDOUT [repository] tofu:       + allow_merge_commit          = true%0A04:06:37.294 STDOUT [repository] tofu:       + allow_rebase_merge          = true%0A04:06:37.294 STDOUT [repository] tofu:       + allow_squash_merge          = true%0A04:06:37.294 STDOUT [repository] tofu:       + allow_update_branch         = true%0A04:06:37.295 STDOUT [repository] tofu:       + archive_on_destroy          = false%0A04:06:37.295 STDOUT [repository] tofu:       + archived                    = false%0A04:06:37.295 STDOUT [repository] tofu:       + auto_init                   = true%0A04:06:37.295 STDOUT [repository] tofu:       + default_branch              = (known after apply)%0A04:06:37.295 STDOUT [repository] tofu:       + delete_branch_on_merge      = true%0A04:06:37.295 STDOUT [repository] tofu:       + description                 = "Organization-wide GitHub configurations, workflows, and community templates"%0A04:06:37.295 STDOUT [repository] tofu:       + etag                        = (known after apply)%0A04:06:37.295 STDOUT [repository] tofu:       + full_name                   = (known after apply)%0A04:06:37.295 STDOUT [repository] tofu:       + git_clone_url               = (known after apply)%0A04:06:37.295 STDOUT [repository] tofu:       + has_discussions             = true%0A04:06:37.295 STDOUT [repository] tofu:       + has_downloads               = false%0A04:06:37.295 STDOUT [repository] tofu:       + has_issues                  = true%0A04:06:37.295 STDOUT [repository] tofu:       + has_projects                = false%0A04:06:37.295 STDOUT [repository] tofu:       + has_wiki                    = true%0A04:06:37.295 STDOUT [repository] tofu:       + html_url                    = (known after apply)%0A04:06:37.295 STDOUT [repository] tofu:       + http_clone_url              = (known after apply)%0A04:06:37.295 STDOUT [repository] tofu:       + id                          = (known after apply)%0A04:06:37.295 STDOUT [repository] tofu:       + license_template            = "mit"%0A04:06:37.295 STDOUT [repository] tofu:       + merge_commit_message        = "PR_TITLE"%0A04:06:37.295 STDOUT [repository] tofu:       + merge_commit_title          = "MERGE_MESSAGE"%0A04:06:37.295 STDOUT [repository] tofu:       + name                        = ".github"%0A04:06:37.296 STDOUT [repository] tofu:       + node_id                     = (known after apply)%0A04:06:37.296 STDOUT [repository] tofu:       + primary_language            = (known after apply)%0A04:06:37.296 STDOUT [repository] tofu:       + private                     = (known after apply)%0A04:06:37.296 STDOUT [repository] tofu:       + repo_id                     = (known after apply)%0A04:06:37.296 STDOUT [repository] tofu:       + squash_merge_commit_message = "PR_BODY"%0A04:06:37.296 STDOUT [repository] tofu:       + squash_merge_commit_title   = "PR_TITLE"%0A04:06:37.296 STDOUT [repository] tofu:       + ssh_clone_url               = (known after apply)%0A04:06:37.296 STDOUT [repository] tofu:       + svn_url                     = (known after apply)%0A04:06:37.296 STDOUT [repository] tofu:       + topics                      = [%0A04:06:37.296 STDOUT [repository] tofu:           + "automation",%0A04:06:37.296 STDOUT [repository] tofu:           + "community",%0A04:06:37.296 STDOUT [repository] tofu:           + "github",%0A04:06:37.296 STDOUT [repository] tofu:           + "templates",%0A04:06:37.296 STDOUT [repository] tofu:           + "workflows",%0A04:06:37.296 STDOUT [repository] tofu:         ]%0A04:06:37.296 STDOUT [repository] tofu:       + visibility                  = "public"%0A04:06:37.296 STDOUT [repository] tofu:       + vulnerability_alerts        = true%0A04:06:37.296 STDOUT [repository] tofu:       + web_commit_signoff_required = false%0A04:06:37.296 STDOUT [repository] tofu:       + security_and_analysis (known after apply)%0A04:06:37.296 STDOUT [repository] tofu:     }%0A04:06:37.296 STDOUT [repository] tofu:   # github_repository.all["github-management"] will be created%0A04:06:37.296 STDOUT [repository] tofu:   + resource "github_repository" "all" {%0A04:06:37.296 STDOUT [repository] tofu:       + allow_auto_merge            = false%0A04:06:37.296 STDOUT [repository] tofu:       + allow_merge_commit          = true%0A04:06:37.296 STDOUT [repository] tofu:       + allow_rebase_merge          = true%0A04:06:37.296 STDOUT [repository] tofu:       + allow_squash_merge          = true%0A04:06:37.296 STDOUT [repository] tofu:       + allow_update_branch         = true%0A04:06:37.297 STDOUT [repository] tofu:       + archive_on_destroy          = false%0A04:06:37.297 STDOUT [repository] tofu:       + archived                    = false%0A04:06:37.297 STDOUT [repository] tofu:       + auto_init                   = true%0A04:06:37.297 STDOUT [repository] tofu:       + default_branch              = (known after apply)%0A04:06:37.297 STDOUT [repository] tofu:       + delete_branch_on_merge      = true%0A04:06:37.297 STDOUT [repository] tofu:       + description                 = "Infrastructure as Code for GitHub organization, repositories, and security management"%0A04:06:37.297 STDOUT [repository] tofu:       + etag                        = (known after apply)%0A04:06:37.297 STDOUT [repository] tofu:       + full_name                   = (known after apply)%0A04:06:37.297 STDOUT [repository] tofu:       + git_clone_url               = (known after apply)%0A04:06:37.297 STDOUT [repository] tofu:       + gitignore_template          = "Terraform"%0A04:06:37.297 STDOUT [repository] tofu:       + has_discussions             = false%0A04:06:37.297 STDOUT [repository] tofu:       + has_downloads               = false%0A04:06:37.297 STDOUT [repository] tofu:       + has_issues                  = true%0A04:06:37.297 STDOUT [repository] tofu:       + has_projects                = false%0A04:06:37.297 STDOUT [repository] tofu:       + has_wiki                    = false%0A04:06:37.297 STDOUT [repository] tofu:       + html_url                    = (known after apply)%0A04:06:37.297 STDOUT [repository] tofu:       + http_clone_url              = (known after apply)%0A04:06:37.297 STDOUT [repository] tofu:       + id                          = (known after apply)%0A04:06:37.297 STDOUT [repository] tofu:       + merge_commit_message        = "PR_TITLE"%0A04:06:37.297 STDOUT [repository] tofu:       + merge_commit_title          = "MERGE_MESSAGE"%0A04:06:37.297 STDOUT [repository] tofu:       + name                        = "github-management"%0A04:06:37.297 STDOUT [repository] tofu:       + node_id                     = (known after apply)%0A04:06:37.298 STDOUT [repository] tofu:       + primary_language            = (known after apply)%0A04:06:37.298 STDOUT [repository] tofu:       + private                     = (known after apply)%0A04:06:37.298 STDOUT [repository] tofu:       + repo_id                     = (known after apply)%0A04:06:37.298 STDOUT [repository] tofu:       + squash_merge_commit_message = "PR_BODY"%0A04:06:37.298 STDOUT [repository] tofu:       + squash_merge_commit_title   = "PR_TITLE"%0A04:06:37.298 STDOUT [repository] tofu:       + ssh_clone_url               = (known after apply)%0A04:06:37.298 STDOUT [repository] tofu:       + svn_url                     = (known after apply)%0A04:06:37.298 STDOUT [repository] tofu:       + topics                      = [%0A04:06:37.298 STDOUT [repository] tofu:           + "automation",%0A04:06:37.298 STDOUT [repository] tofu:           + "github",%0A04:06:37.298 STDOUT [repository] tofu:           + "infrastructure",%0A04:06:37.298 STDOUT [repository] tofu:           + "security",%0A04:06:37.298 STDOUT [repository] tofu:           + "terraform",%0A04:06:37.298 STDOUT [repository] tofu:         ]%0A04:06:37.298 STDOUT [repository] tofu:       + visibility                  = "public"%0A04:06:37.298 STDOUT [repository] tofu:       + vulnerability_alerts        = true%0A04:06:37.298 STDOUT [repository] tofu:       + web_commit_signoff_required = false%0A04:06:37.298 STDOUT [repository] tofu:       + security_and_analysis (known after apply)%0A04:06:37.298 STDOUT [repository] tofu:     }%0A04:06:37.298 STDOUT [repository] tofu:   # github_repository.all["gitops"] will be created%0A04:06:37.298 STDOUT [repository] tofu:   + resource "github_repository" "all" {%0A04:06:37.298 STDOUT [repository] tofu:       + allow_auto_merge            = false%0A04:06:37.298 STDOUT [repository] tofu:       + allow_merge_commit          = true%0A04:06:37.298 STDOUT [repository] tofu:       + allow_rebase_merge          = true%0A04:06:37.298 STDOUT [repository] tofu:       + allow_squash_merge          = true%0A04:06:37.298 STDOUT [repository] tofu:       + allow_update_branch         = true%0A04:06:37.299 STDOUT [repository] tofu:       + archive_on_destroy          = false%0A04:06:37.299 STDOUT [repository] tofu:       + archived                    = false%0A04:06:37.299 STDOUT [repository] tofu:       + auto_init                   = true%0A04:06:37.299 STDOUT [repository] tofu:       + default_branch              = (known after apply)%0A04:06:37.299 STDOUT [repository] tofu:       + delete_branch_on_merge      = true%0A04:06:37.299 STDOUT [repository] tofu:       + description                 = "GitOps repository for Kubernetes application deployments using ArgoCD and Helm"%0A04:06:37.299 STDOUT [repository] tofu:       + etag                        = (known after apply)%0A04:06:37.299 STDOUT [repository] tofu:       + full_name                   = (known after apply)%0A04:06:37.299 STDOUT [repository] tofu:       + git_clone_url               = (known after apply)%0A04:06:37.299 STDOUT [repository] tofu:       + gitignore_template          = "Terraform"%0A04:06:37.299 STDOUT [repository] tofu:       + has_discussions             = false%0A04:06:37.299 STDOUT [repository] tofu:       + has_downloads               = false%0A04:06:37.299 STDOUT [repository] tofu:       + has_issues                  = true%0A04:06:37.299 STDOUT [repository] tofu:       + has_projects                = false%0A04:06:37.299 STDOUT [repository] tofu:       + has_wiki                    = false%0A04:06:37.299 STDOUT [repository] tofu:       + html_url                    = (known after apply)%0A04:06:37.299 STDOUT [repository] tofu:       + http_clone_url              = (known after apply)%0A04:06:37.299 STDOUT [repository] tofu:       + id                          = (known after apply)%0A04:06:37.299 STDOUT [repository] tofu:       + merge_commit_message        = "PR_TITLE"%0A04:06:37.299 STDOUT [repository] tofu:       + merge_commit_title          = "MERGE_MESSAGE"%0A04:06:37.299 STDOUT [repository] tofu:       + name                        = "gitops"%0A04:06:37.299 STDOUT [repository] tofu:       + node_id                     = (known after apply)%0A04:06:37.299 STDOUT [repository] tofu:       + primary_language            = (known after apply)%0A04:06:37.299 STDOUT [repository] tofu:       + private                     = (known after apply)%0A04:06:37.300 STDOUT [repository] tofu:       + repo_id                     = (known after apply)%0A04:06:37.300 STDOUT [repository] tofu:       + squash_merge_commit_message = "PR_BODY"%0A04:06:37.300 STDOUT [repository] tofu:       + squash_merge_commit_title   = "PR_TITLE"%0A04:06:37.300 STDOUT [repository] tofu:       + ssh_clone_url               = (known after apply)%0A04:06:37.300 STDOUT [repository] tofu:       + svn_url                     = (known after apply)%0A04:06:37.300 STDOUT [repository] tofu:       + topics                      = [%0A04:06:37.300 STDOUT [repository] tofu:           + "argocd",%0A04:06:37.300 STDOUT [repository] tofu:           + "deployments",%0A04:06:37.300 STDOUT [repository] tofu:           + "gitops",%0A04:06:37.300 STDOUT [repository] tofu:           + "helm",%0A04:06:37.300 STDOUT [repository] tofu:           + "kubernetes",%0A04:06:37.300 STDOUT [repository] tofu:         ]%0A04:06:37.300 STDOUT [repository] tofu:       + visibility                  = "public"%0A04:06:37.300 STDOUT [repository] tofu:       + vulnerability_alerts        = true%0A04:06:37.300 STDOUT [repository] tofu:       + web_commit_signoff_required = false%0A04:06:37.300 STDOUT [repository] tofu:       + security_and_analysis (known after apply)%0A04:06:37.300 STDOUT [repository] tofu:     }%0A04:06:37.300 STDOUT [repository] tofu:   # github_repository.all["infra-live"] will be created%0A04:06:37.300 STDOUT [repository] tofu:   + resource "github_repository" "all" {%0A04:06:37.300 STDOUT [repository] tofu:       + allow_auto_merge            = false%0A04:06:37.300 STDOUT [repository] tofu:       + allow_merge_commit          = true%0A04:06:37.300 STDOUT [repository] tofu:       + allow_rebase_merge          = true%0A04:06:37.300 STDOUT [repository] tofu:       + allow_squash_merge          = true%0A04:06:37.300 STDOUT [repository] tofu:       + allow_update_branch         = true%0A04:06:37.300 STDOUT [repository] tofu:       + archive_on_destroy          = false%0A04:06:37.300 STDOUT [repository] tofu:       + archived                    = false%0A04:06:37.300 STDOUT [repository] tofu:       + auto_init                   = true%0A04:06:37.301 STDOUT [repository] tofu:       + default_branch              = (known after apply)%0A04:06:37.301 STDOUT [repository] tofu:       + delete_branch_on_merge      = true%0A04:06:37.301 STDOUT [repository] tofu:       + description                 = "Live infrastructure configurations managed with Terragrunt for environment-specific deployments"%0A04:06:37.301 STDOUT [repository] tofu:       + etag                        = (known after apply)%0A04:06:37.301 STDOUT [repository] tofu:       + full_name                   = (known after apply)%0A04:06:37.301 STDOUT [repository] tofu:       + git_clone_url               = (known after apply)%0A04:06:37.301 STDOUT [repository] tofu:       + gitignore_template          = "Terraform"%0A04:06:37.301 STDOUT [repository] tofu:       + has_discussions             = false%0A04:06:37.301 STDOUT [repository] tofu:       + has_downloads               = false%0A04:06:37.301 STDOUT [repository] tofu:       + has_issues                  = true%0A04:06:37.301 STDOUT [repository] tofu:       + has_projects                = false%0A04:06:37.301 STDOUT [repository] tofu:       + has_wiki                    = false%0A04:06:37.301 STDOUT [repository] tofu:       + html_url                    = (known after apply)%0A04:06:37.301 STDOUT [repository] tofu:       + http_clone_url              = (known after apply)%0A04:06:37.301 STDOUT [repository] tofu:       + id                          = (known after apply)%0A04:06:37.301 STDOUT [repository] tofu:       + merge_commit_message        = "PR_TITLE"%0A04:06:37.301 STDOUT [repository] tofu:       + merge_commit_title          = "MERGE_MESSAGE"%0A04:06:37.301 STDOUT [repository] tofu:       + name                        = "infra-live"%0A04:06:37.301 STDOUT [repository] tofu:       + node_id                     = (known after apply)%0A04:06:37.301 STDOUT [repository] tofu:       + primary_language            = (known after apply)%0A04:06:37.301 STDOUT [repository] tofu:       + private                     = (known after apply)%0A04:06:37.302 STDOUT [repository] tofu:       + repo_id                     = (known after apply)%0A04:06:37.302 STDOUT [repository] tofu:       + squash_merge_commit_message = "PR_BODY"%0A04:06:37.302 STDOUT [repository] tofu:       + squash_merge_commit_title   = "PR_TITLE"%0A04:06:37.302 STDOUT [repository] tofu:       + ssh_clone_url               = (known after apply)%0A04:06:37.302 STDOUT [repository] tofu:       + svn_url                     = (known after apply)%0A04:06:37.302 STDOUT [repository] tofu:       + topics                      = [%0A04:06:37.302 STDOUT [repository] tofu:           + "environments",%0A04:06:37.302 STDOUT [repository] tofu:           + "infrastructure",%0A04:06:37.302 STDOUT [repository] tofu:           + "production",%0A04:06:37.302 STDOUT [repository] tofu:           + "terraform",%0A04:06:37.302 STDOUT [repository] tofu:           + "terragrunt",%0A04:06:37.302 STDOUT [repository] tofu:         ]%0A04:06:37.302 STDOUT [repository] tofu:       + visibility                  = "public"%0A04:06:37.302 STDOUT [repository] tofu:       + vulnerability_alerts        = true%0A04:06:37.302 STDOUT [repository] tofu:       + web_commit_signoff_required = false%0A04:06:37.302 STDOUT [repository] tofu:       + security_and_analysis (known after apply)%0A04:06:37.302 STDOUT [repository] tofu:     }%0A04:06:37.302 STDOUT [repository] tofu:   # github_repository.all["infra-modules"] will be created%0A04:06:37.302 STDOUT [repository] tofu:   + resource "github_repository" "all" {%0A04:06:37.302 STDOUT [repository] tofu:       + allow_auto_merge            = false%0A04:06:37.302 STDOUT [repository] tofu:       + allow_merge_commit          = true%0A04:06:37.302 STDOUT [repository] tofu:       + allow_rebase_merge          = true%0A04:06:37.302 STDOUT [repository] tofu:       + allow_squash_merge          = true%0A04:06:37.302 STDOUT [repository] tofu:       + allow_update_branch         = true%0A04:06:37.302 STDOUT [repository] tofu:       + archive_on_destroy          = false%0A04:06:37.303 STDOUT [repository] tofu:       + archived                    = false%0A04:06:37.303 STDOUT [repository] tofu:       + auto_init                   = true%0A04:06:37.303 STDOUT [repository] tofu:       + default_branch              = (known after apply)%0A04:06:37.303 STDOUT [repository] tofu:       + delete_branch_on_merge      = true%0A04:06:37.303 STDOUT [repository] tofu:       + description                 = "Reusable Terraform modules for cloud infrastructure and Kubernetes platform components"%0A04:06:37.303 STDOUT [repository] tofu:       + etag                        = (known after apply)%0A04:06:37.303 STDOUT [repository] tofu:       + full_name                   = (known after apply)%0A04:06:37.303 STDOUT [repository] tofu:       + git_clone_url               = (known after apply)%0A04:06:37.303 STDOUT [repository] tofu:       + gitignore_template          = "Terraform"%0A04:06:37.303 STDOUT [repository] tofu:       + has_discussions             = false%0A04:06:37.303 STDOUT [repository] tofu:       + has_downloads               = false%0A04:06:37.303 STDOUT [repository] tofu:       + has_issues                  = true%0A04:06:37.303 STDOUT [repository] tofu:       + has_projects                = false%0A04:06:37.303 STDOUT [repository] tofu:       + has_wiki                    = false%0A04:06:37.303 STDOUT [repository] tofu:       + html_url                    = (known after apply)%0A04:06:37.303 STDOUT [repository] tofu:       + http_clone_url              = (known after apply)%0A04:06:37.303 STDOUT [repository] tofu:       + id                          = (known after apply)%0A04:06:37.303 STDOUT [repository] tofu:       + merge_commit_message        = "PR_TITLE"%0A04:06:37.303 STDOUT [repository] tofu:       + merge_commit_title          = "MERGE_MESSAGE"%0A04:06:37.303 STDOUT [repository] tofu:       + name                        = "infra-modules"%0A04:06:37.303 STDOUT [repository] tofu:       + node_id                     = (known after apply)%0A04:06:37.304 STDOUT [repository] tofu:       + primary_language            = (known after apply)%0A04:06:37.304 STDOUT [repository] tofu:       + private                     = (known after apply)%0A04:06:37.304 STDOUT [repository] tofu:       + repo_id                     = (known after apply)%0A04:06:37.304 STDOUT [repository] tofu:       + squash_merge_commit_message = "PR_BODY"%0A04:06:37.304 STDOUT [repository] tofu:       + squash_merge_commit_title   = "PR_TITLE"%0A04:06:37.304 STDOUT [repository] tofu:       + ssh_clone_url               = (known after apply)%0A04:06:37.304 STDOUT [repository] tofu:       + svn_url                     = (known after apply)%0A04:06:37.304 STDOUT [repository] tofu:       + topics                      = [%0A04:06:37.304 STDOUT [repository] tofu:           + "cloud",%0A04:06:37.304 STDOUT [repository] tofu:           + "infrastructure",%0A04:06:37.304 STDOUT [repository] tofu:           + "kubernetes",%0A04:06:37.304 STDOUT [repository] tofu:           + "modules",%0A04:06:37.304 STDOUT [repository] tofu:           + "terraform",%0A04:06:37.304 STDOUT [repository] tofu:         ]%0A04:06:37.304 STDOUT [repository] tofu:       + visibility                  = "public"%0A04:06:37.304 STDOUT [repository] tofu:       + vulnerability_alerts        = true%0A04:06:37.304 STDOUT [repository] tofu:       + web_commit_signoff_required = false%0A04:06:37.304 STDOUT [repository] tofu:       + security_and_analysis (known after apply)%0A04:06:37.304 STDOUT [repository] tofu:     }%0A04:06:37.304 STDOUT [repository] tofu:   # github_repository_milestone.all[".github:Phase 1: Milestone 1"] will be created%0A04:06:37.304 STDOUT [repository] tofu:   + resource "github_repository_milestone" "all" {%0A04:06:37.304 STDOUT [repository] tofu:       + description = "Milestone 1"%0A04:06:37.304 STDOUT [repository] tofu:       + due_date    = "2025-09-01"%0A04:06:37.304 STDOUT [repository] tofu:       + id          = (known after apply)%0A04:06:37.305 STDOUT [repository] tofu:       + number      = (known after apply)%0A04:06:37.305 STDOUT [repository] tofu:       + owner       = "exploring-gh-organizations"%0A04:06:37.305 STDOUT [repository] tofu:       + repository  = ".github"%0A04:06:37.305 STDOUT [repository] tofu:       + state       = "open"%0A04:06:37.305 STDOUT [repository] tofu:       + title       = "Phase 1: Milestone 1"%0A04:06:37.305 STDOUT [repository] tofu:     }%0A04:06:37.305 STDOUT [repository] tofu:   # github_repository_milestone.all["github-management:Phase 1: Milestone 1"] will be created%0A04:06:37.305 STDOUT [repository] tofu:   + resource "github_repository_milestone" "all" {%0A04:06:37.305 STDOUT [repository] tofu:       + description = "Milestone 1"%0A04:06:37.305 STDOUT [repository] tofu:       + due_date    = "2025-09-01"%0A04:06:37.305 STDOUT [repository] tofu:       + id          = (known after apply)%0A04:06:37.305 STDOUT [repository] tofu:       + number      = (known after apply)%0A04:06:37.305 STDOUT [repository] tofu:       + owner       = "exploring-gh-organizations"%0A04:06:37.305 STDOUT [repository] tofu:       + repository  = "github-management"%0A04:06:37.305 STDOUT [repository] tofu:       + state       = "open"%0A04:06:37.305 STDOUT [repository] tofu:       + title       = "Phase 1: Milestone 1"%0A04:06:37.305 STDOUT [repository] tofu:     }%0A04:06:37.305 STDOUT [repository] tofu:   # github_repository_milestone.all["gitops:Phase 1: Milestone 1"] will be created%0A04:06:37.305 STDOUT [repository] tofu:   + resource "github_repository_milestone" "all" {%0A04:06:37.305 STDOUT [repository] tofu:       + description = "Milestone 1"%0A04:06:37.305 STDOUT [repository] tofu:       + due_date    = "2025-09-01"%0A04:06:37.305 STDOUT [repository] tofu:       + id          = (known after apply)%0A04:06:37.305 STDOUT [repository] tofu:       + number      = (known after apply)%0A04:06:37.305 STDOUT [repository] tofu:       + owner       = "exploring-gh-organizations"%0A04:06:37.305 STDOUT [repository] tofu:       + repository  = "gitops"%0A04:06:37.305 STDOUT [repository] tofu:       + state       = "open"%0A04:06:37.306 STDOUT [repository] tofu:       + title       = "Phase 1: Milestone 1"%0A04:06:37.306 STDOUT [repository] tofu:     }%0A04:06:37.306 STDOUT [repository] tofu:   # github_repository_milestone.all["infra-live:Phase 1: Milestone 1"] will be created%0A04:06:37.306 STDOUT [repository] tofu:   + resource "github_repository_milestone" "all" {%0A04:06:37.306 STDOUT [repository] tofu:       + description = "Milestone 1"%0A04:06:37.306 STDOUT [repository] tofu:       + due_date    = "2025-09-01"%0A04:06:37.306 STDOUT [repository] tofu:       + id          = (known after apply)%0A04:06:37.306 STDOUT [repository] tofu:       + number      = (known after apply)%0A04:06:37.306 STDOUT [repository] tofu:       + owner       = "exploring-gh-organizations"%0A04:06:37.306 STDOUT [repository] tofu:       + repository  = "infra-live"%0A04:06:37.306 STDOUT [repository] tofu:       + state       = "open"%0A04:06:37.306 STDOUT [repository] tofu:       + title       = "Phase 1: Milestone 1"%0A04:06:37.306 STDOUT [repository] tofu:     }%0A04:06:37.306 STDOUT [repository] tofu:   # github_repository_milestone.all["infra-modules:Phase 1: Milestone 1"] will be created%0A04:06:37.306 STDOUT [repository] tofu:   + resource "github_repository_milestone" "all" {%0A04:06:37.306 STDOUT [repository] tofu:       + description = "Milestone 1"%0A04:06:37.306 STDOUT [repository] tofu:       + due_date    = "2025-09-01"%0A04:06:37.306 STDOUT [repository] tofu:       + id          = (known after apply)%0A04:06:37.306 STDOUT [repository] tofu:       + number      = (known after apply)%0A04:06:37.306 STDOUT [repository] tofu:       + owner       = "exploring-gh-organizations"%0A04:06:37.306 STDOUT [repository] tofu:       + repository  = "infra-modules"%0A04:06:37.306 STDOUT [repository] tofu:       + state       = "open"%0A04:06:37.306 STDOUT [repository] tofu:       + title       = "Phase 1: Milestone 1"%0A04:06:37.306 STDOUT [repository] tofu:     }%0A04:06:37.306 STDOUT [repository] tofu:   # github_repository_ruleset.repo_rulesets[".github:public-security"] will be created%0A04:06:37.306 STDOUT [repository] tofu:   + resource "github_repository_ruleset" "repo_rulesets" {%0A04:06:37.307 STDOUT [repository] tofu:       + enforcement = "active"%0A04:06:37.307 STDOUT [repository] tofu:       + etag        = (known after apply)%0A04:06:37.307 STDOUT [repository] tofu:       + id          = (known after apply)%0A04:06:37.307 STDOUT [repository] tofu:       + name        = "Maximum Security Protection PUBLIC REPOS"%0A04:06:37.307 STDOUT [repository] tofu:       + node_id     = (known after apply)%0A04:06:37.307 STDOUT [repository] tofu:       + repository  = ".github"%0A04:06:37.307 STDOUT [repository] tofu:       + ruleset_id  = (known after apply)%0A04:06:37.307 STDOUT [repository] tofu:       + target      = "branch"%0A04:06:37.307 STDOUT [repository] tofu:       + bypass_actors {%0A04:06:37.307 STDOUT [repository] tofu:           + actor_id    = 1%0A04:06:37.307 STDOUT [repository] tofu:           + actor_type  = "OrganizationAdmin"%0A04:06:37.307 STDOUT [repository] tofu:           + bypass_mode = "always"%0A04:06:37.307 STDOUT [repository] tofu:         }%0A04:06:37.307 STDOUT [repository] tofu:       + bypass_actors {%0A04:06:37.307 STDOUT [repository] tofu:           + actor_id    = 5%0A04:06:37.307 STDOUT [repository] tofu:           + actor_type  = "RepositoryRole"%0A04:06:37.307 STDOUT [repository] tofu:           + bypass_mode = "pull_request"%0A04:06:37.307 STDOUT [repository] tofu:         }%0A04:06:37.307 STDOUT [repository] tofu:       + conditions {%0A04:06:37.307 STDOUT [repository] tofu:           + ref_name {%0A04:06:37.307 STDOUT [repository] tofu:               + exclude = []%0A04:06:37.307 STDOUT [repository] tofu:               + include = [%0A04:06:37.307 STDOUT [repository] tofu:                   + "~DEFAULT_BRANCH",%0A04:06:37.307 STDOUT [repository] tofu:                 ]%0A04:06:37.307 STDOUT [repository] tofu:             }%0A04:06:37.307 STDOUT [repository] tofu:         }%0A04:06:37.307 STDOUT [repository] tofu:       + rules {%0A04:06:37.307 STDOUT [repository] tofu:           + creation                      = true%0A04:06:37.307 STDOUT [repository] tofu:           + deletion                      = true%0A04:06:37.308 STDOUT [repository] tofu:           + non_fast_forward              = true%0A04:06:37.308 STDOUT [repository] tofu:           + required_linear_history       = true%0A04:06:37.308 STDOUT [repository] tofu:           + required_signatures           = true%0A04:06:37.308 STDOUT [repository] tofu:           + update                        = true%0A04:06:37.308 STDOUT [repository] tofu:           + update_allows_fetch_and_merge = false%0A04:06:37.308 STDOUT [repository] tofu:           + branch_name_pattern {%0A04:06:37.308 STDOUT [repository] tofu:               + name     = "Valid Branch Names"%0A04:06:37.308 STDOUT [repository] tofu:               + negate   = true%0A04:06:37.308 STDOUT [repository] tofu:               + operator = "regex"%0A04:06:37.308 STDOUT [repository] tofu:               + pattern  = "^(main|develop|feature/.+|fix/.+|hotfix/.+|release/.+)$"%0A04:06:37.308 STDOUT [repository] tofu:             }%0A04:06:37.308 STDOUT [repository] tofu:           + commit_message_pattern {%0A04:06:37.308 STDOUT [repository] tofu:               + name     = "Conventional Commits"%0A04:06:37.308 STDOUT [repository] tofu:               + negate   = false%0A04:06:37.308 STDOUT [repository] tofu:               + operator = "regex"%0A04:06:37.308 STDOUT [repository] tofu:               + pattern  = "^(feat|fix|docs|style|refactor|perf|test|chore)(\(.+\))?: .+"%0A04:06:37.308 STDOUT [repository] tofu:             }%0A04:06:37.308 STDOUT [repository] tofu:           + merge_queue {%0A04:06:37.308 STDOUT [repository] tofu:               + check_response_timeout_minutes    = 60%0A04:06:37.308 STDOUT [repository] tofu:               + grouping_strategy                 = "ALLGREEN"%0A04:06:37.308 STDOUT [repository] tofu:               + max_entries_to_build              = 5%0A04:06:37.308 STDOUT [repository] tofu:               + max_entries_to_merge              = 5%0A04:06:37.308 STDOUT [repository] tofu:               + merge_method                      = "SQUASH"%0A04:06:37.309 STDOUT [repository] tofu:               + min_entries_to_merge              = 1%0A04:06:37.309 STDOUT [repository] tofu:               + min_entries_to_merge_wait_minutes = 5%0A04:06:37.309 STDOUT [repository] tofu:             }%0A04:06:37.309 STDOUT [repository] tofu:           + pull_request {%0A04:06:37.309 STDOUT [repository] tofu:               + dismiss_stale_reviews_on_push     = true%0A04:06:37.309 STDOUT [repository] tofu:               + require_code_owner_review         = true%0A04:06:37.309 STDOUT [repository] tofu:               + require_last_push_approval        = true%0A04:06:37.309 STDOUT [repository] tofu:               + required_approving_review_count   = 2%0A04:06:37.309 STDOUT [repository] tofu:               + required_review_thread_resolution = true%0A04:06:37.309 STDOUT [repository] tofu:             }%0A04:06:37.309 STDOUT [repository] tofu:           + required_code_scanning {%0A04:06:37.309 STDOUT [repository] tofu:               + required_code_scanning_tool {%0A04:06:37.309 STDOUT [repository] tofu:                   + alerts_threshold          = "errors_and_warnings"%0A04:06:37.309 STDOUT [repository] tofu:                   + security_alerts_threshold = "high_or_higher"%0A04:06:37.309 STDOUT [repository] tofu:                   + tool                      = "CodeQL"%0A04:06:37.309 STDOUT [repository] tofu:                 }%0A04:06:37.309 STDOUT [repository] tofu:             }%0A04:06:37.309 STDOUT [repository] tofu:           + required_status_checks {%0A04:06:37.309 STDOUT [repository] tofu:               + do_not_enforce_on_create             = false%0A04:06:37.309 STDOUT [repository] tofu:               + strict_required_status_checks_policy = true%0A04:06:37.309 STDOUT [repository] tofu:               + required_check {%0A04:06:37.309 STDOUT [repository] tofu:                   + context        = "Code Quality"%0A04:06:37.309 STDOUT [repository] tofu:                   + integration_id = 0%0A04:06:37.310 STDOUT [repository] tofu:                 }%0A04:06:37.310 STDOUT [repository] tofu:               + required_check {%0A04:06:37.310 STDOUT [repository] tofu:                   + context        = "Security Scan"%0A04:06:37.310 STDOUT [repository] tofu:                   + integration_id = 0%0A04:06:37.310 STDOUT [repository] tofu:                 }%0A04:06:37.310 STDOUT [repository] tofu:               + required_check {%0A04:06:37.310 STDOUT [repository] tofu:                   + context        = "Tests"%0A04:06:37.310 STDOUT [repository] tofu:                   + integration_id = 0%0A04:06:37.310 STDOUT [repository] tofu:                 }%0A04:06:37.310 STDOUT [repository] tofu:             }%0A04:06:37.310 STDOUT [repository] tofu:         }%0A04:06:37.310 STDOUT [repository] tofu:     }%0A04:06:37.310 STDOUT [repository] tofu:   # github_repository_ruleset.repo_rulesets["github-management:public-security"] will be created%0A04:06:37.310 STDOUT [repository] tofu:   + resource "github_repository_ruleset" "repo_rulesets" {%0A04:06:37.310 STDOUT [repository] tofu:       + enforcement = "active"%0A04:06:37.310 STDOUT [repository] tofu:       + etag        = (known after apply)%0A04:06:37.310 STDOUT [repository] tofu:       + id          = (known after apply)%0A04:06:37.310 STDOUT [repository] tofu:       + name        = "Maximum Security Protection PUBLIC REPOS"%0A04:06:37.310 STDOUT [repository] tofu:       + node_id     = (known after apply)%0A04:06:37.310 STDOUT [repository] tofu:       + repository  = "github-management"%0A04:06:37.310 STDOUT [repository] tofu:       + ruleset_id  = (known after apply)%0A04:06:37.310 STDOUT [repository] tofu:       + target      = "branch"%0A04:06:37.310 STDOUT [repository] tofu:       + bypass_actors {%0A04:06:37.310 STDOUT [repository] tofu:           + actor_id    = 1%0A04:06:37.310 STDOUT [repository] tofu:           + actor_type  = "OrganizationAdmin"%0A04:06:37.310 STDOUT [repository] tofu:           + bypass_mode = "always"%0A04:06:37.310 STDOUT [repository] tofu:         }%0A04:06:37.310 STDOUT [repository] tofu:       + bypass_actors {%0A04:06:37.311 STDOUT [repository] tofu:           + actor_id    = 5%0A04:06:37.311 STDOUT [repository] tofu:           + actor_type  = "RepositoryRole"%0A04:06:37.311 STDOUT [repository] tofu:           + bypass_mode = "pull_request"%0A04:06:37.311 STDOUT [repository] tofu:         }%0A04:06:37.311 STDOUT [repository] tofu:       + conditions {%0A04:06:37.311 STDOUT [repository] tofu:           + ref_name {%0A04:06:37.311 STDOUT [repository] tofu:               + exclude = []%0A04:06:37.311 STDOUT [repository] tofu:               + include = [%0A04:06:37.311 STDOUT [repository] tofu:                   + "~DEFAULT_BRANCH",%0A04:06:37.311 STDOUT [repository] tofu:                 ]%0A04:06:37.311 STDOUT [repository] tofu:             }%0A04:06:37.311 STDOUT [repository] tofu:         }%0A04:06:37.311 STDOUT [repository] tofu:       + rules {%0A04:06:37.311 STDOUT [repository] tofu:           + creation                      = true%0A04:06:37.311 STDOUT [repository] tofu:           + deletion                      = true%0A04:06:37.311 STDOUT [repository] tofu:           + non_fast_forward              = true%0A04:06:37.311 STDOUT [repository] tofu:           + required_linear_history       = true%0A04:06:37.311 STDOUT [repository] tofu:           + required_signatures           = true%0A04:06:37.311 STDOUT [repository] tofu:           + update                        = true%0A04:06:37.311 STDOUT [repository] tofu:           + update_allows_fetch_and_merge = false%0A04:06:37.311 STDOUT [repository] tofu:           + branch_name_pattern {%0A04:06:37.311 STDOUT [repository] tofu:               + name     = "Valid Branch Names"%0A04:06:37.311 STDOUT [repository] tofu:               + negate   = true%0A04:06:37.311 STDOUT [repository] tofu:               + operator = "regex"%0A04:06:37.311 STDOUT [repository] tofu:               + pattern  = "^(main|develop|feature/.+|fix/.+|hotfix/.+|release/.+)$"%0A04:06:37.311 STDOUT [repository] tofu:             }%0A04:06:37.311 STDOUT [repository] tofu:           + commit_message_pattern {%0A04:06:37.311 STDOUT [repository] tofu:               + name     = "Conventional Commits"%0A04:06:37.311 STDOUT [repository] tofu:               + negate   = false%0A04:06:37.312 STDOUT [repository] tofu:               + operator = "regex"%0A04:06:37.312 STDOUT [repository] tofu:               + pattern  = "^(feat|fix|docs|style|refactor|perf|test|chore)(\(.+\))?: .+"%0A04:06:37.312 STDOUT [repository] tofu:             }%0A04:06:37.312 STDOUT [repository] tofu:           + merge_queue {%0A04:06:37.312 STDOUT [repository] tofu:               + check_response_timeout_minutes    = 60%0A04:06:37.312 STDOUT [repository] tofu:               + grouping_strategy                 = "ALLGREEN"%0A04:06:37.312 STDOUT [repository] tofu:               + max_entries_to_build              = 5%0A04:06:37.312 STDOUT [repository] tofu:               + max_entries_to_merge              = 5%0A04:06:37.312 STDOUT [repository] tofu:               + merge_method                      = "SQUASH"%0A04:06:37.312 STDOUT [repository] tofu:               + min_entries_to_merge              = 1%0A04:06:37.312 STDOUT [repository] tofu:               + min_entries_to_merge_wait_minutes = 5%0A04:06:37.312 STDOUT [repository] tofu:             }%0A04:06:37.312 STDOUT [repository] tofu:           + pull_request {%0A04:06:37.312 STDOUT [repository] tofu:               + dismiss_stale_reviews_on_push     = true%0A04:06:37.312 STDOUT [repository] tofu:               + require_code_owner_review         = true%0A04:06:37.312 STDOUT [repository] tofu:               + require_last_push_approval        = true%0A04:06:37.312 STDOUT [repository] tofu:               + required_approving_review_count   = 2%0A04:06:37.312 STDOUT [repository] tofu:               + required_review_thread_resolution = true%0A04:06:37.312 STDOUT [repository] tofu:             }%0A04:06:37.312 STDOUT [repository] tofu:           + required_code_scanning {%0A04:06:37.312 STDOUT [repository] tofu:               + required_code_scanning_tool {%0A04:06:37.312 STDOUT [repository] tofu:                   + alerts_threshold          = "errors_and_warnings"%0A04:06:37.313 STDOUT [repository] tofu:                   + security_alerts_threshold = "high_or_higher"%0A04:06:37.313 STDOUT [repository] tofu:                   + tool                      = "CodeQL"%0A04:06:37.313 STDOUT [repository] tofu:                 }%0A04:06:37.313 STDOUT [repository] tofu:             }%0A04:06:37.313 STDOUT [repository] tofu:           + required_status_checks {%0A04:06:37.313 STDOUT [repository] tofu:               + do_not_enforce_on_create             = false%0A04:06:37.313 STDOUT [repository] tofu:               + strict_required_status_checks_policy = true%0A04:06:37.313 STDOUT [repository] tofu:               + required_check {%0A04:06:37.313 STDOUT [repository] tofu:                   + context        = "Code Quality"%0A04:06:37.313 STDOUT [repository] tofu:                   + integration_id = 0%0A04:06:37.313 STDOUT [repository] tofu:                 }%0A04:06:37.313 STDOUT [repository] tofu:               + required_check {%0A04:06:37.313 STDOUT [repository] tofu:                   + context        = "Security Scan"%0A04:06:37.313 STDOUT [repository] tofu:                   + integration_id = 0%0A04:06:37.313 STDOUT [repository] tofu:                 }%0A04:06:37.313 STDOUT [repository] tofu:               + required_check {%0A04:06:37.313 STDOUT [repository] tofu:                   + context        = "Tests"%0A04:06:37.313 STDOUT [repository] tofu:                   + integration_id = 0%0A04:06:37.313 STDOUT [repository] tofu:                 }%0A04:06:37.313 STDOUT [repository] tofu:             }%0A04:06:37.313 STDOUT [repository] tofu:         }%0A04:06:37.313 STDOUT [repository] tofu:     }%0A04:06:37.313 STDOUT [repository] tofu:   # github_repository_ruleset.repo_rulesets["gitops:public-security"] will be created%0A04:06:37.313 STDOUT [repository] tofu:   + resource "github_repository_ruleset" "repo_rulesets" {%0A04:06:37.314 STDOUT [repository] tofu:       + enforcement = "active"%0A04:06:37.314 STDOUT [repository] tofu:       + etag        = (known after apply)%0A04:06:37.314 STDOUT [repository] tofu:       + id          = (known after apply)%0A04:06:37.314 STDOUT [repository] tofu:       + name        = "Maximum Security Protection PUBLIC REPOS"%0A04:06:37.314 STDOUT [repository] tofu:       + node_id     = (known after apply)%0A04:06:37.314 STDOUT [repository] tofu:       + repository  = "gitops"%0A04:06:37.314 STDOUT [repository] tofu:       + ruleset_id  = (known after apply)%0A04:06:37.314 STDOUT [repository] tofu:       + target      = "branch"%0A04:06:37.314 STDOUT [repository] tofu:       + bypass_actors {%0A04:06:37.314 STDOUT [repository] tofu:           + actor_id    = 1%0A04:06:37.314 STDOUT [repository] tofu:           + actor_type  = "OrganizationAdmin"%0A04:06:37.314 STDOUT [repository] tofu:           + bypass_mode = "always"%0A04:06:37.314 STDOUT [repository] tofu:         }%0A04:06:37.314 STDOUT [repository] tofu:       + bypass_actors {%0A04:06:37.314 STDOUT [repository] tofu:           + actor_id    = 5%0A04:06:37.314 STDOUT [repository] tofu:           + actor_type  = "RepositoryRole"%0A04:06:37.314 STDOUT [repository] tofu:           + bypass_mode = "pull_request"%0A04:06:37.314 STDOUT [repository] tofu:         }%0A04:06:37.314 STDOUT [repository] tofu:       + conditions {%0A04:06:37.314 STDOUT [repository] tofu:           + ref_name {%0A04:06:37.314 STDOUT [repository] tofu:               + exclude = []%0A04:06:37.314 STDOUT [repository] tofu:               + include = [%0A04:06:37.314 STDOUT [repository] tofu:                   + "~DEFAULT_BRANCH",%0A04:06:37.314 STDOUT [repository] tofu:                 ]%0A04:06:37.314 STDOUT [repository] tofu:             }%0A04:06:37.314 STDOUT [repository] tofu:         }%0A04:06:37.314 STDOUT [repository] tofu:       + rules {%0A04:06:37.314 STDOUT [repository] tofu:           + creation                      = true%0A04:06:37.314 STDOUT [repository] tofu:           + deletion                      = true%0A04:06:37.314 STDOUT [repository] tofu:           + non_fast_forward              = true%0A04:06:37.315 STDOUT [repository] tofu:           + required_linear_history       = true%0A04:06:37.315 STDOUT [repository] tofu:           + required_signatures           = true%0A04:06:37.315 STDOUT [repository] tofu:           + update                        = true%0A04:06:37.315 STDOUT [repository] tofu:           + update_allows_fetch_and_merge = false%0A04:06:37.315 STDOUT [repository] tofu:           + branch_name_pattern {%0A04:06:37.315 STDOUT [repository] tofu:               + name     = "Valid Branch Names"%0A04:06:37.315 STDOUT [repository] tofu:               + negate   = true%0A04:06:37.315 STDOUT [repository] tofu:               + operator = "regex"%0A04:06:37.315 STDOUT [repository] tofu:               + pattern  = "^(main|develop|feature/.+|fix/.+|hotfix/.+|release/.+)$"%0A04:06:37.315 STDOUT [repository] tofu:             }%0A04:06:37.315 STDOUT [repository] tofu:           + commit_message_pattern {%0A04:06:37.315 STDOUT [repository] tofu:               + name     = "Conventional Commits"%0A04:06:37.315 STDOUT [repository] tofu:               + negate   = false%0A04:06:37.315 STDOUT [repository] tofu:               + operator = "regex"%0A04:06:37.315 STDOUT [repository] tofu:               + pattern  = "^(feat|fix|docs|style|refactor|perf|test|chore)(\(.+\))?: .+"%0A04:06:37.315 STDOUT [repository] tofu:             }%0A04:06:37.315 STDOUT [repository] tofu:           + merge_queue {%0A04:06:37.315 STDOUT [repository] tofu:               + check_response_timeout_minutes    = 60%0A04:06:37.315 STDOUT [repository] tofu:               + grouping_strategy                 = "ALLGREEN"%0A04:06:37.315 STDOUT [repository] tofu:               + max_entries_to_build              = 5%0A04:06:37.315 STDOUT [repository] tofu:               + max_entries_to_merge              = 5%0A04:06:37.315 STDOUT [repository] tofu:               + merge_method                      = "SQUASH"%0A04:06:37.315 STDOUT [repository] tofu:               + min_entries_to_merge              = 1%0A04:06:37.316 STDOUT [repository] tofu:               + min_entries_to_merge_wait_minutes = 5%0A04:06:37.316 STDOUT [repository] tofu:             }%0A04:06:37.316 STDOUT [repository] tofu:           + pull_request {%0A04:06:37.316 STDOUT [repository] tofu:               + dismiss_stale_reviews_on_push     = true%0A04:06:37.316 STDOUT [repository] tofu:               + require_code_owner_review         = true%0A04:06:37.316 STDOUT [repository] tofu:               + require_last_push_approval        = true%0A04:06:37.316 STDOUT [repository] tofu:               + required_approving_review_count   = 2%0A04:06:37.316 STDOUT [repository] tofu:               + required_review_thread_resolution = true%0A04:06:37.316 STDOUT [repository] tofu:             }%0A04:06:37.316 STDOUT [repository] tofu:           + required_code_scanning {%0A04:06:37.316 STDOUT [repository] tofu:               + required_code_scanning_tool {%0A04:06:37.316 STDOUT [repository] tofu:                   + alerts_threshold          = "errors_and_warnings"%0A04:06:37.316 STDOUT [repository] tofu:                   + security_alerts_threshold = "high_or_higher"%0A04:06:37.316 STDOUT [repository] tofu:                   + tool                      = "CodeQL"%0A04:06:37.316 STDOUT [repository] tofu:                 }%0A04:06:37.316 STDOUT [repository] tofu:             }%0A04:06:37.316 STDOUT [repository] tofu:           + required_status_checks {%0A04:06:37.316 STDOUT [repository] tofu:               + do_not_enforce_on_create             = false%0A04:06:37.316 STDOUT [repository] tofu:               + strict_required_status_checks_policy = true%0A04:06:37.316 STDOUT [repository] tofu:               + required_check {%0A04:06:37.316 STDOUT [repository] tofu:                   + context        = "Code Quality"%0A04:06:37.316 STDOUT [repository] tofu:                   + integration_id = 0%0A04:06:37.316 STDOUT [repository] tofu:                 }%0A04:06:37.316 STDOUT [repository] tofu:               + required_check {%0A04:06:37.317 STDOUT [repository] tofu:                   + context        = "Security Scan"%0A04:06:37.317 STDOUT [repository] tofu:                   + integration_id = 0%0A04:06:37.317 STDOUT [repository] tofu:                 }%0A04:06:37.317 STDOUT [repository] tofu:               + required_check {%0A04:06:37.317 STDOUT [repository] tofu:                   + context        = "Tests"%0A04:06:37.317 STDOUT [repository] tofu:                   + integration_id = 0%0A04:06:37.317 STDOUT [repository] tofu:                 }%0A04:06:37.317 STDOUT [repository] tofu:             }%0A04:06:37.317 STDOUT [repository] tofu:         }%0A04:06:37.317 STDOUT [repository] tofu:     }%0A04:06:37.317 STDOUT [repository] tofu:   # github_repository_ruleset.repo_rulesets["infra-live:public-security"] will be created%0A04:06:37.317 STDOUT [repository] tofu:   + resource "github_repository_ruleset" "repo_rulesets" {%0A04:06:37.317 STDOUT [repository] tofu:       + enforcement = "active"%0A04:06:37.317 STDOUT [repository] tofu:       + etag        = (known after apply)%0A04:06:37.317 STDOUT [repository] tofu:       + id          = (known after apply)%0A04:06:37.317 STDOUT [repository] tofu:       + name        = "Maximum Security Protection PUBLIC REPOS"%0A04:06:37.317 STDOUT [repository] tofu:       + node_id     = (known after apply)%0A04:06:37.317 STDOUT [repository] tofu:       + repository  = "infra-live"%0A04:06:37.317 STDOUT [repository] tofu:       + ruleset_id  = (known after apply)%0A04:06:37.317 STDOUT [repository] tofu:       + target      = "branch"%0A04:06:37.317 STDOUT [repository] tofu:       + bypass_actors {%0A04:06:37.317 STDOUT [repository] tofu:           + actor_id    = 1%0A04:06:37.317 STDOUT [repository] tofu:           + actor_type  = "OrganizationAdmin"%0A04:06:37.317 STDOUT [repository] tofu:           + bypass_mode = "always"%0A04:06:37.317 STDOUT [repository] tofu:         }%0A04:06:37.317 STDOUT [repository] tofu:       + bypass_actors {%0A04:06:37.317 STDOUT [repository] tofu:           + actor_id    = 5%0A04:06:37.317 STDOUT [repository] tofu:           + actor_type  = "RepositoryRole"%0A04:06:37.318 STDOUT [repository] tofu:           + bypass_mode = "pull_request"%0A04:06:37.318 STDOUT [repository] tofu:         }%0A04:06:37.318 STDOUT [repository] tofu:       + conditions {%0A04:06:37.318 STDOUT [repository] tofu:           + ref_name {%0A04:06:37.318 STDOUT [repository] tofu:               + exclude = []%0A04:06:37.318 STDOUT [repository] tofu:               + include = [%0A04:06:37.318 STDOUT [repository] tofu:                   + "~DEFAULT_BRANCH",%0A04:06:37.318 STDOUT [repository] tofu:                 ]%0A04:06:37.318 STDOUT [repository] tofu:             }%0A04:06:37.318 STDOUT [repository] tofu:         }%0A04:06:37.318 STDOUT [repository] tofu:       + rules {%0A04:06:37.318 STDOUT [repository] tofu:           + creation                      = true%0A04:06:37.318 STDOUT [repository] tofu:           + deletion                      = true%0A04:06:37.318 STDOUT [repository] tofu:           + non_fast_forward              = true%0A04:06:37.318 STDOUT [repository] tofu:           + required_linear_history       = true%0A04:06:37.318 STDOUT [repository] tofu:           + required_signatures           = true%0A04:06:37.318 STDOUT [repository] tofu:           + update                        = true%0A04:06:37.318 STDOUT [repository] tofu:           + update_allows_fetch_and_merge = false%0A04:06:37.318 STDOUT [repository] tofu:           + branch_name_pattern {%0A04:06:37.318 STDOUT [repository] tofu:               + name     = "Valid Branch Names"%0A04:06:37.318 STDOUT [repository] tofu:               + negate   = true%0A04:06:37.318 STDOUT [repository] tofu:               + operator = "regex"%0A04:06:37.318 STDOUT [repository] tofu:               + pattern  = "^(main|develop|feature/.+|fix/.+|hotfix/.+|release/.+)$"%0A04:06:37.318 STDOUT [repository] tofu:             }%0A04:06:37.318 STDOUT [repository] tofu:           + commit_message_pattern {%0A04:06:37.318 STDOUT [repository] tofu:               + name     = "Conventional Commits"%0A04:06:37.318 STDOUT [repository] tofu:               + negate   = false%0A04:06:37.319 STDOUT [repository] tofu:               + operator = "regex"%0A04:06:37.319 STDOUT [repository] tofu:               + pattern  = "^(feat|fix|docs|style|refactor|perf|test|chore)(\(.+\))?: .+"%0A04:06:37.319 STDOUT [repository] tofu:             }%0A04:06:37.319 STDOUT [repository] tofu:           + merge_queue {%0A04:06:37.319 STDOUT [repository] tofu:               + check_response_timeout_minutes    = 60%0A04:06:37.319 STDOUT [repository] tofu:               + grouping_strategy                 = "ALLGREEN"%0A04:06:37.319 STDOUT [repository] tofu:               + max_entries_to_build              = 5%0A04:06:37.319 STDOUT [repository] tofu:               + max_entries_to_merge              = 5%0A04:06:37.319 STDOUT [repository] tofu:               + merge_method                      = "SQUASH"%0A04:06:37.319 STDOUT [repository] tofu:               + min_entries_to_merge              = 1%0A04:06:37.319 STDOUT [repository] tofu:               + min_entries_to_merge_wait_minutes = 5%0A04:06:37.319 STDOUT [repository] tofu:             }%0A04:06:37.319 STDOUT [repository] tofu:           + pull_request {%0A04:06:37.319 STDOUT [repository] tofu:               + dismiss_stale_reviews_on_push     = true%0A04:06:37.319 STDOUT [repository] tofu:               + require_code_owner_review         = true%0A04:06:37.319 STDOUT [repository] tofu:               + require_last_push_approval        = true%0A04:06:37.319 STDOUT [repository] tofu:               + required_approving_review_count   = 2%0A04:06:37.319 STDOUT [repository] tofu:               + required_review_thread_resolution = true%0A04:06:37.319 STDOUT [repository] tofu:             }%0A04:06:37.319 STDOUT [repository] tofu:           + required_code_scanning {%0A04:06:37.319 STDOUT [repository] tofu:               + required_code_scanning_tool {%0A04:06:37.319 STDOUT [repository] tofu:                   + alerts_threshold          = "errors_and_warnings"%0A04:06:37.319 STDOUT [repository] tofu:                   + security_alerts_threshold = "high_or_higher"%0A04:06:37.320 STDOUT [repository] tofu:                   + tool                      = "CodeQL"%0A04:06:37.320 STDOUT [repository] tofu:                 }%0A04:06:37.320 STDOUT [repository] tofu:             }%0A04:06:37.320 STDOUT [repository] tofu:           + required_status_checks {%0A04:06:37.320 STDOUT [repository] tofu:               + do_not_enforce_on_create             = false%0A04:06:37.320 STDOUT [repository] tofu:               + strict_required_status_checks_policy = true%0A04:06:37.320 STDOUT [repository] tofu:               + required_check {%0A04:06:37.320 STDOUT [repository] tofu:                   + context        = "Code Quality"%0A04:06:37.320 STDOUT [repository] tofu:                   + integration_id = 0%0A04:06:37.320 STDOUT [repository] tofu:                 }%0A04:06:37.320 STDOUT [repository] tofu:               + required_check {%0A04:06:37.320 STDOUT [repository] tofu:                   + context        = "Security Scan"%0A04:06:37.320 STDOUT [repository] tofu:                   + integration_id = 0%0A04:06:37.320 STDOUT [repository] tofu:                 }%0A04:06:37.320 STDOUT [repository] tofu:               + required_check {%0A04:06:37.320 STDOUT [repository] tofu:                   + context        = "Tests"%0A04:06:37.320 STDOUT [repository] tofu:                   + integration_id = 0%0A04:06:37.320 STDOUT [repository] tofu:                 }%0A04:06:37.320 STDOUT [repository] tofu:             }%0A04:06:37.320 STDOUT [repository] tofu:         }%0A04:06:37.320 STDOUT [repository] tofu:     }%0A04:06:37.320 STDOUT [repository] tofu:   # github_repository_ruleset.repo_rulesets["infra-modules:public-security"] will be created%0A04:06:37.320 STDOUT [repository] tofu:   + resource "github_repository_ruleset" "repo_rulesets" {%0A04:06:37.320 STDOUT [repository] tofu:       + enforcement = "active"%0A04:06:37.320 STDOUT [repository] tofu:       + etag        = (known after apply)%0A04:06:37.320 STDOUT [repository] tofu:       + id          = (known after apply)%0A04:06:37.321 STDOUT [repository] tofu:       + name        = "Maximum Security Protection PUBLIC REPOS"%0A04:06:37.321 STDOUT [repository] tofu:       + node_id     = (known after apply)%0A04:06:37.321 STDOUT [repository] tofu:       + repository  = "infra-modules"%0A04:06:37.321 STDOUT [repository] tofu:       + ruleset_id  = (known after apply)%0A04:06:37.321 STDOUT [repository] tofu:       + target      = "branch"%0A04:06:37.321 STDOUT [repository] tofu:       + bypass_actors {%0A04:06:37.321 STDOUT [repository] tofu:           + actor_id    = 1%0A04:06:37.321 STDOUT [repository] tofu:           + actor_type  = "OrganizationAdmin"%0A04:06:37.321 STDOUT [repository] tofu:           + bypass_mode = "always"%0A04:06:37.321 STDOUT [repository] tofu:         }%0A04:06:37.321 STDOUT [repository] tofu:       + bypass_actors {%0A04:06:37.321 STDOUT [repository] tofu:           + actor_id    = 5%0A04:06:37.321 STDOUT [repository] tofu:           + actor_type  = "RepositoryRole"%0A04:06:37.321 STDOUT [repository] tofu:           + bypass_mode = "pull_request"%0A04:06:37.321 STDOUT [repository] tofu:         }%0A04:06:37.321 STDOUT [repository] tofu:       + conditions {%0A04:06:37.321 STDOUT [repository] tofu:           + ref_name {%0A04:06:37.321 STDOUT [repository] tofu:               + exclude = []%0A04:06:37.321 STDOUT [repository] tofu:               + include = [%0A04:06:37.321 STDOUT [repository] tofu:                   + "~DEFAULT_BRANCH",%0A04:06:37.321 STDOUT [repository] tofu:                 ]%0A04:06:37.321 STDOUT [repository] tofu:             }%0A04:06:37.321 STDOUT [repository] tofu:         }%0A04:06:37.321 STDOUT [repository] tofu:       + rules {%0A04:06:37.321 STDOUT [repository] tofu:           + creation                      = true%0A04:06:37.321 STDOUT [repository] tofu:           + deletion                      = true%0A04:06:37.321 STDOUT [repository] tofu:           + non_fast_forward              = true%0A04:06:37.321 STDOUT [repository] tofu:           + required_linear_history       = true%0A04:06:37.321 STDOUT [repository] tofu:           + required_signatures           = true%0A04:06:37.321 STDOUT [repository] tofu:           + update                        = true%0A04:06:37.322 STDOUT [repository] tofu:           + update_allows_fetch_and_merge = false%0A04:06:37.322 STDOUT [repository] tofu:           + branch_name_pattern {%0A04:06:37.322 STDOUT [repository] tofu:               + name     = "Valid Branch Names"%0A04:06:37.322 STDOUT [repository] tofu:               + negate   = true%0A04:06:37.322 STDOUT [repository] tofu:               + operator = "regex"%0A04:06:37.322 STDOUT [repository] tofu:               + pattern  = "^(main|develop|feature/.+|fix/.+|hotfix/.+|release/.+)$"%0A04:06:37.322 STDOUT [repository] tofu:             }%0A04:06:37.322 STDOUT [repository] tofu:           + commit_message_pattern {%0A04:06:37.322 STDOUT [repository] tofu:               + name     = "Conventional Commits"%0A04:06:37.322 STDOUT [repository] tofu:               + negate   = false%0A04:06:37.322 STDOUT [repository] tofu:               + operator = "regex"%0A04:06:37.322 STDOUT [repository] tofu:               + pattern  = "^(feat|fix|docs|style|refactor|perf|test|chore)(\(.+\))?: .+"%0A04:06:37.322 STDOUT [repository] tofu:             }%0A04:06:37.322 STDOUT [repository] tofu:           + merge_queue {%0A04:06:37.322 STDOUT [repository] tofu:               + check_response_timeout_minutes    = 60%0A04:06:37.322 STDOUT [repository] tofu:               + grouping_strategy                 = "ALLGREEN"%0A04:06:37.322 STDOUT [repository] tofu:               + max_entries_to_build              = 5%0A04:06:37.322 STDOUT [repository] tofu:               + max_entries_to_merge              = 5%0A04:06:37.322 STDOUT [repository] tofu:               + merge_method                      = "SQUASH"%0A04:06:37.322 STDOUT [repository] tofu:               + min_entries_to_merge              = 1%0A04:06:37.322 STDOUT [repository] tofu:               + min_entries_to_merge_wait_minutes = 5%0A04:06:37.322 STDOUT [repository] tofu:             }%0A04:06:37.322 STDOUT [repository] tofu:           + pull_request {%0A04:06:37.323 STDOUT [repository] tofu:               + dismiss_stale_reviews_on_push     = true%0A04:06:37.323 STDOUT [repository] tofu:               + require_code_owner_review         = true%0A04:06:37.323 STDOUT [repository] tofu:               + require_last_push_approval        = true%0A04:06:37.323 STDOUT [repository] tofu:               + required_approving_review_count   = 2%0A04:06:37.323 STDOUT [repository] tofu:               + required_review_thread_resolution = true%0A04:06:37.323 STDOUT [repository] tofu:             }%0A04:06:37.323 STDOUT [repository] tofu:           + required_code_scanning {%0A04:06:37.323 STDOUT [repository] tofu:               + required_code_scanning_tool {%0A04:06:37.323 STDOUT [repository] tofu:                   + alerts_threshold          = "errors_and_warnings"%0A04:06:37.323 STDOUT [repository] tofu:                   + security_alerts_threshold = "high_or_higher"%0A04:06:37.323 STDOUT [repository] tofu:                   + tool                      = "CodeQL"%0A04:06:37.323 STDOUT [repository] tofu:                 }%0A04:06:37.323 STDOUT [repository] tofu:             }%0A04:06:37.323 STDOUT [repository] tofu:           + required_status_checks {%0A04:06:37.323 STDOUT [repository] tofu:               + do_not_enforce_on_create             = false%0A04:06:37.323 STDOUT [repository] tofu:               + strict_required_status_checks_policy = true%0A04:06:37.323 STDOUT [repository] tofu:               + required_check {%0A04:06:37.323 STDOUT [repository] tofu:                   + context        = "Code Quality"%0A04:06:37.323 STDOUT [repository] tofu:                   + integration_id = 0%0A04:06:37.323 STDOUT [repository] tofu:                 }%0A04:06:37.323 STDOUT [repository] tofu:               + required_check {%0A04:06:37.323 STDOUT [repository] tofu:                   + context        = "Security Scan"%0A04:06:37.323 STDOUT [repository] tofu:                   + integration_id = 0%0A04:06:37.323 STDOUT [repository] tofu:                 }%0A04:06:37.324 STDOUT [repository] tofu:               + required_check {%0A04:06:37.324 STDOUT [repository] tofu:                   + context        = "Tests"%0A04:06:37.324 STDOUT [repository] tofu:                   + integration_id = 0%0A04:06:37.324 STDOUT [repository] tofu:                 }%0A04:06:37.324 STDOUT [repository] tofu:             }%0A04:06:37.324 STDOUT [repository] tofu:         }%0A04:06:37.324 STDOUT [repository] tofu:     }%0A04:06:37.324 STDOUT [repository] tofu: Plan: 25 to add, 0 to change, 0 to destroy.%0A04:06:37.324 STDOUT [repository] tofu: Changes to Outputs:%0A04:06:37.324 STDOUT [repository] tofu:   + collaborators = {}%0A04:06:37.324 STDOUT [repository] tofu:   + labels        = {%0A04:06:37.324 STDOUT [repository] tofu:       + ".github:bug"             = {%0A04:06:37.324 STDOUT [repository] tofu:           + color       = "d73a4a"%0A04:06:37.324 STDOUT [repository] tofu:           + description = "Something isn't working"%0A04:06:37.324 STDOUT [repository] tofu:           + name        = "bug"%0A04:06:37.324 STDOUT [repository] tofu:           + repository  = ".github"%0A04:06:37.324 STDOUT [repository] tofu:           + url         = (known after apply)%0A04:06:37.324 STDOUT [repository] tofu:         }%0A04:06:37.324 STDOUT [repository] tofu:       + ".github:stuff"           = {%0A04:06:37.324 STDOUT [repository] tofu:           + color       = "a2eeef"%0A04:06:37.324 STDOUT [repository] tofu:           + description = "Stuff"%0A04:06:37.324 STDOUT [repository] tofu:           + name        = "stuff"%0A04:06:37.324 STDOUT [repository] tofu:           + repository  = ".github"%0A04:06:37.324 STDOUT [repository] tofu:           + url         = (known after apply)%0A04:06:37.324 STDOUT [repository] tofu:         }%0A04:06:37.324 STDOUT [repository] tofu:       + "github-management:bug"   = {%0A04:06:37.324 STDOUT [repository] tofu:           + color       = "d73a4a"%0A04:06:37.324 STDOUT [repository] tofu:           + description = "Something isn't working"%0A04:06:37.324 STDOUT [repository] tofu:           + name        = "bug"%0A04:06:37.324 STDOUT [repository] tofu:           + repository  = "github-management"%0A04:06:37.325 STDOUT [repository] tofu:           + url         = (known after apply)%0A04:06:37.325 STDOUT [repository] tofu:         }%0A04:06:37.325 STDOUT [repository] tofu:       + "github-management:stuff" = {%0A04:06:37.325 STDOUT [repository] tofu:           + color       = "a2eeef"%0A04:06:37.325 STDOUT [repository] tofu:           + description = "Stuff"%0A04:06:37.325 STDOUT [repository] tofu:           + name        = "stuff"%0A04:06:37.325 STDOUT [repository] tofu:           + repository  = "github-management"%0A04:06:37.325 STDOUT [repository] tofu:           + url         = (known after apply)%0A04:06:37.325 STDOUT [repository] tofu:         }%0A04:06:37.325 STDOUT [repository] tofu:       + "gitops:bug"              = {%0A04:06:37.325 STDOUT [repository] tofu:           + color       = "d73a4a"%0A04:06:37.325 STDOUT [repository] tofu:           + description = "Something isn't working"%0A04:06:37.325 STDOUT [repository] tofu:           + name        = "bug"%0A04:06:37.325 STDOUT [repository] tofu:           + repository  = "gitops"%0A04:06:37.325 STDOUT [repository] tofu:           + url         = (known after apply)%0A04:06:37.325 STDOUT [repository] tofu:         }%0A04:06:37.325 STDOUT [repository] tofu:       + "gitops:stuff"            = {%0A04:06:37.325 STDOUT [repository] tofu:           + color       = "a2eeef"%0A04:06:37.325 STDOUT [repository] tofu:           + description = "Stuff"%0A04:06:37.325 STDOUT [repository] tofu:           + name        = "stuff"%0A04:06:37.325 STDOUT [repository] tofu:           + repository  = "gitops"%0A04:06:37.325 STDOUT [repository] tofu:           + url         = (known after apply)%0A04:06:37.325 STDOUT [repository] tofu:         }%0A04:06:37.325 STDOUT [repository] tofu:       + "infra-live:bug"          = {%0A04:06:37.325 STDOUT [repository] tofu:           + color       = "d73a4a"%0A04:06:37.325 STDOUT [repository] tofu:           + description = "Something isn't working"%0A04:06:37.325 STDOUT [repository] tofu:           + name        = "bug"%0A04:06:37.325 STDOUT [repository] tofu:           + repository  = "infra-live"%0A04:06:37.325 STDOUT [repository] tofu:           + url         = (known after apply)%0A04:06:37.325 STDOUT [repository] tofu:         }%0A04:06:37.326 STDOUT [repository] tofu:       + "infra-live:stuff"        = {%0A04:06:37.326 STDOUT [repository] tofu:           + color       = "a2eeef"%0A04:06:37.326 STDOUT [repository] tofu:           + description = "Stuff"%0A04:06:37.326 STDOUT [repository] tofu:           + name        = "stuff"%0A04:06:37.326 STDOUT [repository] tofu:           + repository  = "infra-live"%0A04:06:37.326 STDOUT [repository] tofu:           + url         = (known after apply)%0A04:06:37.326 STDOUT [repository] tofu:         }%0A04:06:37.326 STDOUT [repository] tofu:       + "infra-modules:bug"       = {%0A04:06:37.326 STDOUT [repository] tofu:           + color       = "d73a4a"%0A04:06:37.326 STDOUT [repository] tofu:           + description = "Something isn't working"%0A04:06:37.326 STDOUT [repository] tofu:           + name        = "bug"%0A04:06:37.326 STDOUT [repository] tofu:           + repository  = "infra-modules"%0A04:06:37.326 STDOUT [repository] tofu:           + url         = (known after apply)%0A04:06:37.326 STDOUT [repository] tofu:         }%0A04:06:37.326 STDOUT [repository] tofu:       + "infra-modules:stuff"     = {%0A04:06:37.326 STDOUT [repository] tofu:           + color       = "a2eeef"%0A04:06:37.326 STDOUT [repository] tofu:           + description = "Stuff"%0A04:06:37.326 STDOUT [repository] tofu:           + name        = "stuff"%0A04:06:37.326 STDOUT [repository] tofu:           + repository  = "infra-modules"%0A04:06:37.326 STDOUT [repository] tofu:           + url         = (known after apply)%0A04:06:37.326 STDOUT [repository] tofu:         }%0A04:06:37.326 STDOUT [repository] tofu:     }%0A04:06:37.326 STDOUT [repository] tofu:   + milestones    = {%0A04:06:37.326 STDOUT [repository] tofu:       + ".github:Phase 1: Milestone 1"           = {%0A04:06:37.326 STDOUT [repository] tofu:           + description = "Milestone 1"%0A04:06:37.326 STDOUT [repository] tofu:           + due_date    = "2025-09-01"%0A04:06:37.326 STDOUT [repository] tofu:           + number      = (known after apply)%0A04:06:37.326 STDOUT [repository] tofu:           + repository  = ".github"%0A04:06:37.326 STDOUT [repository] tofu:           + state       = "open"%0A04:06:37.326 STDOUT [repository] tofu:           + title       = "Phase 1: Milestone 1"%0A04:06:37.327 STDOUT [repository] tofu:         }%0A04:06:37.327 STDOUT [repository] tofu:       + "github-management:Phase 1: Milestone 1" = {%0A04:06:37.327 STDOUT [repository] tofu:           + description = "Milestone 1"%0A04:06:37.327 STDOUT [repository] tofu:           + due_date    = "2025-09-01"%0A04:06:37.327 STDOUT [repository] tofu:           + number      = (known after apply)%0A04:06:37.327 STDOUT [repository] tofu:           + repository  = "github-management"%0A04:06:37.327 STDOUT [repository] tofu:           + state       = "open"%0A04:06:37.327 STDOUT [repository] tofu:           + title       = "Phase 1: Milestone 1"%0A04:06:37.327 STDOUT [repository] tofu:         }%0A04:06:37.327 STDOUT [repository] tofu:       + "gitops:Phase 1: Milestone 1"            = {%0A04:06:37.327 STDOUT [repository] tofu:           + description = "Milestone 1"%0A04:06:37.327 STDOUT [repository] tofu:           + due_date    = "2025-09-01"%0A04:06:37.327 STDOUT [repository] tofu:           + number      = (known after apply)%0A04:06:37.327 STDOUT [repository] tofu:           + repository  = "gitops"%0A04:06:37.327 STDOUT [repository] tofu:           + state       = "open"%0A04:06:37.327 STDOUT [repository] tofu:           + title       = "Phase 1: Milestone 1"%0A04:06:37.327 STDOUT [repository] tofu:         }%0A04:06:37.327 STDOUT [repository] tofu:       + "infra-live:Phase 1: Milestone 1"        = {%0A04:06:37.327 STDOUT [repository] tofu:           + description = "Milestone 1"%0A04:06:37.327 STDOUT [repository] tofu:           + due_date    = "2025-09-01"%0A04:06:37.327 STDOUT [repository] tofu:           + number      = (known after apply)%0A04:06:37.327 STDOUT [repository] tofu:           + repository  = "infra-live"%0A04:06:37.327 STDOUT [repository] tofu:           + state       = "open"%0A04:06:37.327 STDOUT [repository] tofu:           + title       = "Phase 1: Milestone 1"%0A04:06:37.327 STDOUT [repository] tofu:         }%0A04:06:37.327 STDOUT [repository] tofu:       + "infra-modules:Phase 1: Milestone 1"     = {%0A04:06:37.327 STDOUT [repository] tofu:           + description = "Milestone 1"%0A04:06:37.328 STDOUT [repository] tofu:           + due_date    = "2025-09-01"%0A04:06:37.328 STDOUT [repository] tofu:           + number      = (known after apply)%0A04:06:37.328 STDOUT [repository] tofu:           + repository  = "infra-modules"%0A04:06:37.328 STDOUT [repository] tofu:           + state       = "open"%0A04:06:37.328 STDOUT [repository] tofu:           + title       = "Phase 1: Milestone 1"%0A04:06:37.328 STDOUT [repository] tofu:         }%0A04:06:37.328 STDOUT [repository] tofu:     }%0A04:06:37.328 STDOUT [repository] tofu:   + repositories  = {%0A04:06:37.328 STDOUT [repository] tofu:       + ".github"         = {%0A04:06:37.328 STDOUT [repository] tofu:           + description    = "Organization-wide GitHub configurations, workflows, and community templates"%0A04:06:37.328 STDOUT [repository] tofu:           + full_name      = (known after apply)%0A04:06:37.328 STDOUT [repository] tofu:           + html_url       = (known after apply)%0A04:06:37.328 STDOUT [repository] tofu:           + http_clone_url = (known after apply)%0A04:06:37.328 STDOUT [repository] tofu:           + id             = (known after apply)%0A04:06:37.328 STDOUT [repository] tofu:           + name           = ".github"%0A04:06:37.328 STDOUT [repository] tofu:           + node_id        = (known after apply)%0A04:06:37.328 STDOUT [repository] tofu:           + ssh_clone_url  = (known after apply)%0A04:06:37.328 STDOUT [repository] tofu:           + topics         = [%0A04:06:37.328 STDOUT [repository] tofu:               + "automation",%0A04:06:37.328 STDOUT [repository] tofu:               + "community",%0A04:06:37.328 STDOUT [repository] tofu:               + "github",%0A04:06:37.328 STDOUT [repository] tofu:               + "templates",%0A04:06:37.328 STDOUT [repository] tofu:               + "workflows",%0A04:06:37.328 STDOUT [repository] tofu:             ]%0A04:06:37.328 STDOUT [repository] tofu:           + visibility     = "public"%0A04:06:37.328 STDOUT [repository] tofu:         }%0A04:06:37.328 STDOUT [repository] tofu:       + github-management = {%0A04:06:37.328 STDOUT [repository] tofu:           + description    = "Infrastructure as Code for GitHub organization, repositories, and security management"%0A04:06:37.329 STDOUT [repository] tofu:           + full_name      = (known after apply)%0A04:06:37.329 STDOUT [repository] tofu:           + html_url       = (known after apply)%0A04:06:37.329 STDOUT [repository] tofu:           + http_clone_url = (known after apply)%0A04:06:37.329 STDOUT [repository] tofu:           + id             = (known after apply)%0A04:06:37.329 STDOUT [repository] tofu:           + name           = "github-management"%0A04:06:37.329 STDOUT [repository] tofu:           + node_id        = (known after apply)%0A04:06:37.329 STDOUT [repository] tofu:           + ssh_clone_url  = (known after apply)%0A04:06:37.329 STDOUT [repository] tofu:           + topics         = [%0A04:06:37.329 STDOUT [repository] tofu:               + "automation",%0A04:06:37.329 STDOUT [repository] tofu:               + "github",%0A04:06:37.329 STDOUT [repository] tofu:               + "infrastructure",%0A04:06:37.329 STDOUT [repository] tofu:               + "security",%0A04:06:37.329 STDOUT [repository] tofu:               + "terraform",%0A04:06:37.329 STDOUT [repository] tofu:             ]%0A04:06:37.329 STDOUT [repository] tofu:           + visibility     = "public"%0A04:06:37.329 STDOUT [repository] tofu:         }%0A04:06:37.329 STDOUT [repository] tofu:       + gitops            = {%0A04:06:37.329 STDOUT [repository] tofu:           + description    = "GitOps repository for Kubernetes application deployments using ArgoCD and Helm"%0A04:06:37.329 STDOUT [repository] tofu:           + full_name      = (known after apply)%0A04:06:37.329 STDOUT [repository] tofu:           + html_url       = (known after apply)%0A04:06:37.329 STDOUT [repository] tofu:           + http_clone_url = (known after apply)%0A04:06:37.329 STDOUT [repository] tofu:           + id             = (known after apply)%0A04:06:37.329 STDOUT [repository] tofu:           + name           = "gitops"%0A04:06:37.329 STDOUT [repository] tofu:           + node_id        = (known after apply)%0A04:06:37.329 STDOUT [repository] tofu:           + ssh_clone_url  = (known after apply)%0A04:06:37.330 STDOUT [repository] tofu:           + topics         = [%0A04:06:37.330 STDOUT [repository] tofu:               + "argocd",%0A04:06:37.330 STDOUT [repository] tofu:               + "deployments",%0A04:06:37.330 STDOUT [repository] tofu:               + "gitops",%0A04:06:37.330 STDOUT [repository] tofu:               + "helm",%0A04:06:37.330 STDOUT [repository] tofu:               + "kubernetes",%0A04:06:37.330 STDOUT [repository] tofu:             ]%0A04:06:37.330 STDOUT [repository] tofu:           + visibility     = "public"%0A04:06:37.330 STDOUT [repository] tofu:         }%0A04:06:37.330 STDOUT [repository] tofu:       + infra-live        = {%0A04:06:37.330 STDOUT [repository] tofu:           + description    = "Live infrastructure configurations managed with Terragrunt for environment-specific deployments"%0A04:06:37.330 STDOUT [repository] tofu:           + full_name      = (known after apply)%0A04:06:37.330 STDOUT [repository] tofu:           + html_url       = (known after apply)%0A04:06:37.330 STDOUT [repository] tofu:           + http_clone_url = (known after apply)%0A04:06:37.330 STDOUT [repository] tofu:           + id             = (known after apply)%0A04:06:37.330 STDOUT [repository] tofu:           + name           = "infra-live"%0A04:06:37.330 STDOUT [repository] tofu:           + node_id        = (known after apply)%0A04:06:37.330 STDOUT [repository] tofu:           + ssh_clone_url  = (known after apply)%0A04:06:37.330 STDOUT [repository] tofu:           + topics         = [%0A04:06:37.330 STDOUT [repository] tofu:               + "environments",%0A04:06:37.330 STDOUT [repository] tofu:               + "infrastructure",%0A04:06:37.330 STDOUT [repository] tofu:               + "production",%0A04:06:37.330 STDOUT [repository] tofu:               + "terraform",%0A04:06:37.330 STDOUT [repository] tofu:               + "terragrunt",%0A04:06:37.330 STDOUT [repository] tofu:             ]%0A04:06:37.330 STDOUT [repository] tofu:           + visibility     = "public"%0A04:06:37.330 STDOUT [repository] tofu:         }%0A04:06:37.330 STDOUT [repository] tofu:       + infra-modules     = {%0A04:06:37.331 STDOUT [repository] tofu:           + description    = "Reusable Terraform modules for cloud infrastructure and Kubernetes platform components"%0A04:06:37.331 STDOUT [repository] tofu:           + full_name      = (known after apply)%0A04:06:37.331 STDOUT [repository] tofu:           + html_url       = (known after apply)%0A04:06:37.331 STDOUT [repository] tofu:           + http_clone_url = (known after apply)%0A04:06:37.331 STDOUT [repository] tofu:           + id             = (known after apply)%0A04:06:37.331 STDOUT [repository] tofu:           + name           = "infra-modules"%0A04:06:37.331 STDOUT [repository] tofu:           + node_id        = (known after apply)%0A04:06:37.331 STDOUT [repository] tofu:           + ssh_clone_url  = (known after apply)%0A04:06:37.331 STDOUT [repository] tofu:           + topics         = [%0A04:06:37.331 STDOUT [repository] tofu:               + "cloud",%0A04:06:37.331 STDOUT [repository] tofu:               + "infrastructure",%0A04:06:37.331 STDOUT [repository] tofu:               + "kubernetes",%0A04:06:37.331 STDOUT [repository] tofu:               + "modules",%0A04:06:37.331 STDOUT [repository] tofu:               + "terraform",%0A04:06:37.331 STDOUT [repository] tofu:             ]%0A04:06:37.331 STDOUT [repository] tofu:           + visibility     = "public"%0A04:06:37.331 STDOUT [repository] tofu:         }%0A04:06:37.331 STDOUT [repository] tofu:     }%0A04:06:37.349 WARN   [repository] Config ./membership/terragrunt.hcl is a dependency of ./repository/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.%0A04:06:37.351 WARN   [organization] Config ./membership/terragrunt.hcl is a dependency of ./organization/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.%0A04:06:37.400 WARN   [organization] Config ./repository/terragrunt.hcl is a dependency of ./organization/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.%0A04:06:37.790 STDOUT [organization] tofu: OpenTofu used the selected providers to generate the following execution%0A04:06:37.790 STDOUT [organization] tofu: plan. Resource actions are indicated with the following symbols:%0A04:06:37.790 STDOUT [organization] tofu:   + create%0A04:06:37.790 STDOUT [organization] tofu: OpenTofu will perform the following actions:%0A04:06:37.790 STDOUT [organization] tofu:   # github_organization_security_manager.security_manager_team will be created%0A04:06:37.790 STDOUT [organization] tofu:   + resource "github_organization_security_manager" "security_manager_team" {%0A04:06:37.790 STDOUT [organization] tofu:       + id        = (known after apply)%0A04:06:37.790 STDOUT [organization] tofu:       + team_slug = "admin"%0A04:06:37.790 STDOUT [organization] tofu:     }%0A04:06:37.790 STDOUT [organization] tofu:   # github_organization_settings.main will be created%0A04:06:37.791 STDOUT [organization] tofu:   + resource "github_organization_settings" "main" {%0A04:06:37.791 STDOUT [organization] tofu:       + advanced_security_enabled_for_new_repositories               = true%0A04:06:37.791 STDOUT [organization] tofu:       + billing_email                                                = "your-email@example.com"%0A04:06:37.791 STDOUT [organization] tofu:       + default_repository_permission                                = "read"%0A04:06:37.791 STDOUT [organization] tofu:       + dependabot_alerts_enabled_for_new_repositories               = true%0A04:06:37.791 STDOUT [organization] tofu:       + dependabot_security_updates_enabled_for_new_repositories     = true%0A04:06:37.791 STDOUT [organization] tofu:       + dependency_graph_enabled_for_new_repositories                = true%0A04:06:37.791 STDOUT [organization] tofu:       + description                                                  = "GH org Playground stuff"%0A04:06:37.791 STDOUT [organization] tofu:       + has_organization_projects                                    = true%0A04:06:37.791 STDOUT [organization] tofu:       + has_repository_projects                                      = false%0A04:06:37.791 STDOUT [organization] tofu:       + id                                                           = (known after apply)%0A04:06:37.791 STDOUT [organization] tofu:       + members_can_create_internal_repositories                     = false%0A04:06:37.791 STDOUT [organization] tofu:       + members_can_create_pages                                     = false%0A04:06:37.791 STDOUT [organization] tofu:       + members_can_create_private_pages                             = false%0A04:06:37.791 STDOUT [organization] tofu:       + members_can_create_private_repositories                      = false%0A04:06:37.791 STDOUT [organization] tofu:       + members_can_create_public_pages                              = false%0A04:06:37.792 STDOUT [organization] tofu:       + members_can_create_public_repositories                       = false%0A04:06:37.792 STDOUT [organization] tofu:       + members_can_create_repositories                              = false%0A04:06:37.792 STDOUT [organization] tofu:       + members_can_fork_private_repositories                        = false%0A04:06:37.792 STDOUT [organization] tofu:       + name                                                         = "Example"%0A04:06:37.792 STDOUT [organization] tofu:       + secret_scanning_enabled_for_new_repositories                 = true%0A04:06:37.792 STDOUT [organization] tofu:       + secret_scanning_push_protection_enabled_for_new_repositories = true%0A04:06:37.792 STDOUT [organization] tofu:       + web_commit_signoff_required                                  = false%0A04:06:37.792 STDOUT [organization] tofu:     }%0A04:06:37.792 STDOUT [organization] tofu: Plan: 2 to add, 0 to change, 0 to destroy.%0A04:06:37.792 STDOUT [organization] tofu: Changes to Outputs:%0A04:06:37.792 STDOUT [organization] tofu:   + organization     = {%0A04:06:37.792 STDOUT [organization] tofu:       + advanced_security_enabled               = true%0A04:06:37.792 STDOUT [organization] tofu:       + billing_email                           = "your-email@example.com"%0A04:06:37.792 STDOUT [organization] tofu:       + blog                                    = null%0A04:06:37.792 STDOUT [organization] tofu:       + default_repository_permission           = "read"%0A04:06:37.792 STDOUT [organization] tofu:       + dependabot_alerts_enabled               = true%0A04:06:37.792 STDOUT [organization] tofu:       + dependabot_security_updates_enabled     = true%0A04:06:37.792 STDOUT [organization] tofu:       + dependency_graph_enabled                = true%0A04:06:37.793 STDOUT [organization] tofu:       + description                             = "GH org Playground stuff"%0A04:06:37.793 STDOUT [organization] tofu:       + email                                   = null%0A04:06:37.793 STDOUT [organization] tofu:       + has_organization_projects               = true%0A04:06:37.793 STDOUT [organization] tofu:       + location                                = null%0A04:06:37.793 STDOUT [organization] tofu:       + name                                    = "Example"%0A04:06:37.793 STDOUT [organization] tofu:       + secret_scanning_enabled                 = true%0A04:06:37.793 STDOUT [organization] tofu:       + secret_scanning_push_protection_enabled = true%0A04:06:37.793 STDOUT [organization] tofu:       + web_commit_signoff_required             = false%0A04:06:37.793 STDOUT [organization] tofu:     }%0A04:06:37.793 STDOUT [organization] tofu:   + security_manager = {%0A04:06:37.793 STDOUT [organization] tofu:       + team_slug = "admin"%0A04:06:37.793 STDOUT [organization] tofu:     }
```

</details>